{"meta":{"title":"Junmeng Lyu","subtitle":"","description":"","author":"Junmeng lyu","url":"https://Lyu2Patrick.github.io","root":"/"},"pages":[{"title":"Paper","date":"2024-03-14T08:41:50.000Z","updated":"2025-03-14T11:01:25.523Z","comments":true,"path":"Paper/index.html","permalink":"https://lyu2patrick.github.io/Paper/index.html","excerpt":"","text":"2025 Analysis of occupant thermal comfort and energy-saving potential based on cooling behaviors in residential buildings: A case study of Shanghai 2024 Main effects and interactions of multiple key factors related to thermal perception Occupant-Centric Cabin Thermal Sensation Assessment System Based on Low-Cost Thermal Imaging Exploring the correlation and synchronicity between environmental factors and occupant thermal response in dynamic outdoor cabin environments Application-driven development of a thermal imaging-based cabin occupant thermal sensation assessment model and its validation Energy saving first or productivity first? — Maximize the economic benefits of urban office buildings Subjective information in thermal comfort evaluation methods: A critical review Experimental Investigation on Effects of Odor Types, Concentrations, and Release Frequencies on Cognitive Performance 2023 Addressing personalized thermal comfort in residential settings: A novel dual-supply vent air conditioner Sex-based thermal comfort zones and energy savings in spaces with joint operation of air conditioner and fan Gender differences in thermal comfort under coupled environmental factors A sleep staging model for the sleep environment control based on machine learning Where should the thermal image sensor of a smart A&#x2F;C look?-Occupant thermal sensation model based on thermal imaging data How do people set air conditioning temperature setpoint in urban domestic–Behavior model in Chinese three climate zones based on historical usage data 2022 Characteristics of PM2.5 emissions from six types of commercial cooking in Chinese cities and their health effects Gender differences in thermal sensation and skin temperature sensitivity under local cooling 2021 Experimental and numerical analysis of air temperature uniformity in occupied zone under stratum ventilation for heating mode"},{"title":"Program","date":"2023-11-30T08:42:17.000Z","updated":"2023-11-30T08:49:39.305Z","comments":true,"path":"Program/index.html","permalink":"https://lyu2patrick.github.io/Program/index.html","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment"},{"title":"Hello World","date":"2023-11-30T09:11:05.748Z","updated":"2023-11-30T05:15:41.144Z","comments":true,"path":"Program/hello-world.html","permalink":"https://lyu2patrick.github.io/Program/hello-world.html","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment"},{"title":"Research Programs","date":"2023-11-30T08:03:08.000Z","updated":"2023-11-30T13:04:26.311Z","comments":true,"path":"categories/index.html","permalink":"https://lyu2patrick.github.io/categories/index.html","excerpt":"","text":"Mechanisms of indoor and outdoor environmental impacts on the physical and mental health of the population and monitoring technology research Air quality assurance system for cabins of large cruise ships research Research on Thermal Environmental Control Strategies Targeting Gender Differences Research on Thermal Sensation Assessment of Vehicle Cabin Occupants Based on Thermal Imaging"},{"title":"my-first-blog","date":"2023-11-30T09:11:22.385Z","updated":"2023-11-30T09:11:22.385Z","comments":true,"path":"Program/my-first-blog.html","permalink":"https://lyu2patrick.github.io/Program/my-first-blog.html","excerpt":"","text":"test"},{"title":"Hello World","date":"2023-11-30T12:51:57.807Z","updated":"2023-11-30T05:15:41.144Z","comments":true,"path":"default/hello-world.html","permalink":"https://lyu2patrick.github.io/default/hello-world.html","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment"},{"title":"About Me","date":"2023-11-30T11:51:39.000Z","updated":"2023-11-30T14:18:42.628Z","comments":true,"path":"about/index.html","permalink":"https://lyu2patrick.github.io/about/index.html","excerpt":"","text":"EDUCATIONSHANGHAI JIAO TONG UNIVERSITY &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Shanghai, China Successive Postgraduate and Doctoral in Architecture (PhD Student) &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;September 2021- At Present CHONGQING UNIVERSITY&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Chongqing, China Bachelor of Building Environment and Energy Application Engineering &nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;June 2021 ​ ACHIEVEMENTS AND RECOGNITIONS · ***2023.11*** Outstanding Graduate Student Scholarship, awarded by Shanghai Jiao Tong University · 2023.07&nbsp;&nbsp;&nbsp; Best paper award, 2023 Healthy Buildings Asia Conference · 2022.09 &nbsp;&nbsp;&nbsp;First-class academic scholarship, awarded by Shanghai Jiao Tong University · 2021.09 &nbsp;&nbsp;&nbsp;First-class academic scholarship, awarded by Shanghai Jiao Tong University · 2021.06 &nbsp;&nbsp;&nbsp;Province-level prize, Chongqing science and technology innovation advanced individual, awarded by Chongqing Ministry of Education · 2021.06&nbsp;&nbsp;&nbsp; Outstanding graduation design, awarded by Chongqing University · 2020.12 &nbsp;&nbsp;&nbsp; Outstanding graduate, awarded by Chongqing University · 2020.12 &nbsp;&nbsp;&nbsp; First-class general scholarship, awarded by Chongqing University · 2020.06 &nbsp;&nbsp;&nbsp;Province-level prize (Excellent), “Mechanisms of thermal airflow distribution in stratum ventilation for heating”, awarded by College Students’ Innovative Entrepreneurial Training Plan Program · 2020.05&nbsp;&nbsp;&nbsp; Innovation and entrepreneurship advanced individual award, awarded by Chongqing University · 2019.12&nbsp;&nbsp;&nbsp; Second-class general scholarship, awarded by Chongqing University · 2019.12 &nbsp;&nbsp;&nbsp; Third-class Qwkrom scholarship, awarded by Qwkrom and Chongqing university · 2019.12 &nbsp;&nbsp;&nbsp; Advanced science, technology, and academic innovation award, awarded by Chongqing university · 2019.10 &nbsp;&nbsp;&nbsp;Outstanding volunteer of “Colorful stone” volunteer program, awarded by Chongqing university · 2019.07 &nbsp;&nbsp;&nbsp; 22-day study and exchange abroad, the 5th “Sustainable Building Environment” summer training program in Britain, held and sponsored by Chongqing University and Reading University · 2019.01 &nbsp;&nbsp;&nbsp; Advanced science, technology, and academic innovation award, awarded by Chongqing university · 2018.12 &nbsp;&nbsp;&nbsp; National-level prize, “Youlu” National BIM Competition, awarded by Talent Exchange Center of the Ministry of Industry and Information Technology · 2018.12 &nbsp;&nbsp;&nbsp;Third-class general scholarship, awarded by Chongqing University · 2018.11 &nbsp;&nbsp;&nbsp;Advanced science, technology, and academic innovation award, awarded by Chongqing university · 2018.07 &nbsp;&nbsp;&nbsp; National silver medal for the 3rd National college students’ advanced technology and product information modeling innovation competition, awarded by Teaching Guidance Committee of the Ministry of Education of China RESEARCH AND PRESENTATIONS Lyu J, Shi Y, Du H, Lian Z (2023). Sex-based thermal comfort zones and energy savings in spaces with joint operation of air conditioner and fan, Build Environ. (2023) 111002. (JCR Q1; IF&#x3D;7.4) Lyu J, Du H, Zhao Z, Shi Y, Wang B, Lian Z (2023). Where should the thermal image sensor of a smart A&#x2F;C look? -Occupant thermal sensation model based on thermal imaging data. Building and Environment, 239, 110405. (JCR Q1; IF&#x3D;7.4) Lyu J, Li J, Zhao Z, Miao X, Du H, Lai D, Yang Y, Lian Z (2023). How do people set air conditioning temperature setpoint in urban domestic–Behavior model in Chinese three climate zones based on historical usage data. Energy and Buildings, 284, 112856. (JCR Q1; IF&#x3D;6.7) Lyu J, Shi Y, Chen C, Zhang X, Chu W, Lian Z (2022). Characteristics of PM2.5 emissions from six types of commercial cooking in Chinese cities and their health effects. Environmental Pollution, 313, 120180. (JCR Q1; IF&#x3D;8.9) Lyu J, Feng X, Cheng Y, Liao C (2021). Experimental and numerical analysis of air temperature uniformity in occupied zone under stratum ventilation for heating mode. Journal of Building Engineering, 43, 103016. (JCR Q1; IF&#x3D;6.4) Lyu J, Zhao Q, Du H, Lian Z, Zhao Z (2023). Gender differences in thermal sensation and skin temperature sensitivity under local cooling. Journal of Thermal Biology, 111, 103401. (JCR Q2; IF&#x3D;2.7) Du H, Zhao, Z, Lyu J, Li J, liu Z, Li X, Yang Y, Lan L, Lian Z (2023). Gender differences in thermal comfort under coupled environmental factors. Energy and Buildings, 295, 113345. (JCR Q1; IF&#x3D;6.7) Cao T, Lian Z, Du H, Shen J, Fan Y, Lyu J (2023). A sleep staging model for the sleep environment control based on machine learning. Building Simulation, 16(8), 1409–1423. (JCR Q1; IF&#x3D;5.5) Yang Y, Zhao Z, Lyu J, Wang B, Li J, Zhang S, Lian Z (2023). Addressing Personalized Thermal Comfort in Residential Settings: A Novel Dual-Supply Vent Air Conditioner. Journal of Building Engineering (JCR Q1; IF&#x3D;6.4) Lyu J, Lai D, Lan L, Lian Z (2023). Dynamic thermal responses of occupants in transient cabin environments: A Controlled Field Study. Building and Environment, (submitted). (JCR Q1; IF&#x3D;7.4) Lyu J, Miao X, Ji Z, Zhao Z, Du H, Lian Z (2023). Correlation analysis between thermal sensation and head skin temperature collected by thermal imager [C]. 2023 Healthy Buildings Asia and Pacific Rim, (EI) Shi Y, Lyu J, Wu J, Lian Z (2023). Optimum indoor environmental parameters of urban office building by economic analysis of performance benefits and energy costs [C]. *2023 Healthy Buildings Asia and Pacific Rim, (EI) Yang Y, Zhao Z, Li J, Ji Z, Lyu J, Lian Z (2023). Influence of differential air supply on creating different thermal environments in domestic shared spaces [C]. 2023 Healthy Buildings Asia and Pacific Rim, (EI) Lyu J, Hou Z, Lai D, Lian Z (2023), Development and Validation of Thermal Imaging-Based Cabin Thermal Sensation Assessment Model [C]. The 13th International Symposium on Heating, Ventilation and Air Conditioning, Beijing, China 2023 (accept) Lyu J, Feng X, Cheng Y. An energy-saving air conditioning directional air supply device based on rotating jets. CN109869886B [P]. 2020-09-15 Lyu J, Lian Z. A method and system for evaluating thermal sensation of cabin occupants based on infrared thermal imaging [P]. (submitted) RESEARCH PROGRAM EXPERIENCE1. Mechanisms of indoor and outdoor environmental impacts on the physical and mental health of the population and monitoring technology research November 2022 – November 2025 National Key Research and Development Program of China, No. BE2022606 ​ Key researcher ​ · Responsible for mechanisms and patterns of influence of typical environmental factors on the physical and mental health of the population research. 2. Air quality assurance system for cabins of large cruise ships research September 2020 – October 2023 Key Research and Development Program of the Ministry of Industry of China ​ Key researcher ​ · Responsible for network modeling between solution physical structures. 3. Research Program sponsored by Midea Air-Conditioning Equipment Co., Ltd November 2021 – August 2023 ​ Key researcher ​ · Completed a thermal imaging-based model for assessing the thermal sensation of indoor occupants. ​ · Establishment of comfort zones for gender-specific indoor environments. ​ · Develop a data-driven thermal sensation model based on historical air-conditioning behavioral data Social workChairman of Graduate Student Association, School of Design, Shanghai Jiao Tong University (May 2022 - Present) SKILLS AND INTERESTSSKILLS: Python, Origin, Photoshop, AutoCAD, Revit, Zotero, Office INTERESTS: Photography, running, listening"},{"title":"","date":"2025-03-14T14:28:35.972Z","updated":"2025-03-14T14:28:35.972Z","comments":true,"path":"photos/photos.html","permalink":"https://lyu2patrick.github.io/photos/photos.html","excerpt":"","text":""},{"title":"timeline","date":"2023-11-30T09:33:27.000Z","updated":"2023-11-30T09:33:27.950Z","comments":true,"path":"timeline/index.html","permalink":"https://lyu2patrick.github.io/timeline/index.html","excerpt":"","text":""},{"title":"My Photo Gallery","date":"2024-03-13T16:00:00.000Z","updated":"2025-03-14T14:29:24.222Z","comments":true,"path":"photos/index.html","permalink":"https://lyu2patrick.github.io/photos/index.html","excerpt":"","text":"📷 My Photo Wall &times; .photo-gallery { display: flex; flex-wrap: wrap; gap: 10px; justify-content: center; } .photo-gallery img { width: 200px; height: 150px; object-fit: cover; border-radius: 5px; cursor: pointer; transition: transform 0.3s; } .photo-gallery img:hover { transform: scale(1.1); } /* Lightbox 样式 */ .lightbox { display: none; position: fixed; z-index: 1000; left: 0; top: 0; width: 100%; height: 100%; background-color: rgba(0,0,0,0.8); text-align: center; } .lightbox-content { max-width: 90%; max-height: 90%; margin-top: 5%; } .close { position: absolute; top: 10px; right: 25px; color: white; font-size: 35px; cursor: pointer; } function openLightbox(src) { document.getElementById('lightbox').style.display = 'block'; document.getElementById('lightbox-img').src = src; } function closeLightbox() { document.getElementById('lightbox').style.display = 'none'; } document.addEventListener(\"DOMContentLoaded\", function() { let lazyImages = document.querySelectorAll(\".lazy-load\"); let observer = new IntersectionObserver(function(entries, observer) { entries.forEach(entry => { if (entry.isIntersecting) { let img = entry.target; img.src = img.dataset.src; // 真实加载图片 img.classList.remove(\"lazy-load\"); observer.unobserve(img); // 取消监听 } }); }, { rootMargin: \"50px\" }); lazyImages.forEach(img => observer.observe(img)); }); function openLightbox(src) { document.getElementById('lightbox').style.display = 'block'; document.getElementById('lightbox-img').src = src; } function closeLightbox() { document.getElementById('lightbox').style.display = 'none'; }"},{"title":"Addressing personalized thermal comfort in residential settings A novel dual supply vent air conditioner","date":"2021-07-24T07:49:29.000Z","updated":"2025-03-14T15:05:13.691Z","comments":true,"path":"Paper/Paper10/index.html","permalink":"https://lyu2patrick.github.io/Paper/Paper10/index.html","excerpt":"","text":"AuthorsYuxin Yang, Zisheng Zhao, Junmeng Lyu, Bo Wang, Jinbo Li, Shuguang Zhang, Zhiwei Lian a School of Design, Shanghai Jiao Tong University, Shanghai, 200240, China b Guangdong Midea Air-Conditioning Equipment Co., Ltd, Guangdong, 528311, China https://doi.org/10.1016/j.jobe.2023.108134 Highlights A new effective approach for personalized comfort in residential settings. Dual-supply vent air conditioner creates diverse thermal zones. Comprehensive impact of temperature and air velocity on human thermal perception. AbstractA new approach was proposed for meeting diverse thermal comfort demands of different occupants by using a dual-supply vent air conditioner with independent control of the air supply parameters at each vent to establish distinct thermal environments. The feasibility of this method was tested in a living room environment, and numerical simulation was conducted to explore the differences in thermal environment at various locations under different air supply temperatures, velocities, directions, and vent positions. The results indicated that, within the targeted air supply zone, the maximum temperature difference could reach around 2.5 °C. Considering the Cooling Effect of air velocity, the maximum Equivalent Temperature difference was around 4.5 °C, which could address the differences in common personalized thermal comfort preference. Utilizing the differential air supply velocities of different vents was an effective means of achieving diverse thermal environments, although attention should be paid to local thermal discomfort caused by drafts. This approach may offer a new perspective in addressing the differing thermal comfort preferences among occupants within the same residential room, additionally providing innovative insights for improving traditional air conditioning systems. Figures Fig. 1. Schematic representation of the scenario ​ Fig. 3. Comparisons between simulated and measured results ​ Fig. 4. Calculated surface ​ Fig. 7. Air temperature and velocity distributions under different air supply directions ​ Fig. 15. Temperature distribution and air velocity vector map at z = 0.6 m height ConclusionsThe potential of creating differentiated thermal environments using two air supply vents on a single air conditioner was investigated. The effects of air supply direction, air supply temperature, air supply velocity, and vent location on the distribution of air temperature and air velocity were analyzed. The differentiation level of the thermal environment was evaluated by assessing the air temperature and the Equivalent Temperature that incorporates the Cooling Effect at different locations within the Target Zone of air conditioning. The main conclusions are as follows: In the Target Zone of air conditioner, three distinct zones could be created: a high-temperature&#x2F;high-velocity zone, a low-temperature&#x2F;high-velocity zone, and a medium-temperature&#x2F;low-velocity zone. Among them, the high-temperature&#x2F;high-velocity zone provided comfortable and energy-efficient operation, while the medium-temperature&#x2F;low-velocity zone was the warmest and the low-temperature&#x2F;high-velocity zone was the coolest. Furthermore, the draught rate in the medium-temperature&#x2F;low-velocity zone was minimized. Taking into account the Cooling Effect, the maximum Equivalent Temperature difference among the three zones could reach around 3.0 °C. The research results demonstrated the feasibility of using dual air supply vents on the air conditioner to create diversified thermal environments. By controlling the air supply temperature difference, the Equivalent Temperature difference among different calculated surfaces within the Target Zone could reach around 4.5 °C, which was possible to meet the common individual thermal demand differences. A supply air temperature difference of 6 °C was already effective in creating a differentiated thermal environment. Fully utilizing the disparities in air velocity was found to be an effective approach in achieving distinct thermal environments. In the experimental conditions, when two vents supplied air at velocities of 4 m&#x2F;s and 6 m&#x2F;s respectively, the maximum Equivalent Temperature difference could be observed within the Target Zone. Compared to horizontally oriented supply airflow, directing airflow towards the Target Zone resulted in greater temperature differences and Equivalent Temperature differences at various positions within the zone. When the two supply vents were positioned too closely, it was necessary to adjust the airflow direction to separate the airflows, ensuring temperature differences and Equivalent Temperature differences at different positions. Paper PDF Viewer Previous Page: / Next import { getDocument, GlobalWorkerOptions } from '/js/pdfjs/pdf.mjs'; var url = \"/files/paper9.pdf\"; var pdfDoc = null; var pageNum = 1; var pageRendering = false; var pageNumPending = null; var scale = 2; var canvas = document.getElementById('pdf-viewer'); var ctx = canvas.getContext('2d'); function renderPage(num) { pageRendering = true; pdfDoc.getPage(num).then(function(page) { var viewport = page.getViewport({ scale: scale }); canvas.width = viewport.width; canvas.height = viewport.height; var renderContext = { canvasContext: ctx, viewport: viewport }; var renderTask = page.render(renderContext); renderTask.promise.then(function() { pageRendering = false; if (pageNumPending !== null) { renderPage(pageNumPending); pageNumPending = null; } }); }); document.getElementById('page-num').textContent = num; } function queueRenderPage(num) { if (pageRendering) { pageNumPending = num; } else { renderPage(num); } } window.prevPage = function() { if (pageNum = pdfDoc.numPages) return; pageNum++; queueRenderPage(pageNum); }; GlobalWorkerOptions.workerSrc = \"/js/pdfjs/pdf.worker.mjs\"; getDocument(url).promise.then(function(pdfDoc_) { pdfDoc = pdfDoc_; document.getElementById('page-count').textContent = pdfDoc.numPages; renderPage(pageNum); });"},{"title":"Experimental and numerical analysis of air temperature uniformity in occupied zone under stratum ventilation for heating mode","date":"2021-07-24T07:49:29.000Z","updated":"2025-03-14T14:41:45.089Z","comments":true,"path":"Paper/Paper1/index.html","permalink":"https://lyu2patrick.github.io/Paper/Paper1/index.html","excerpt":"","text":"AuthorsJunmeng Lyua 1, Xuan Fenga 1, Yong Chenga b c, Chunhui Liaod a School of Civil Engineering, Chongqing University, Chongqing, China b Joint International Research Laboratory of Green Buildings and Built Environments, Ministry of Education, Chongqing University, Chongqing, China c National Centre for International Research of Low-carbon and Green Buildings, Ministry of Science &amp; Technology, Chongqing University, Chongqing, China d Institute for Health and Environment, Chongqing University of Science and Technology, Chongqing, China 1 These two authors contributed equally and should be considered as co-first authors. https://doi.org/10.1016/j.jobe.2021.103016 Highlights Horizontal air temperature uniformity is inferior to vertical under stratum ventilation for heating. Supply air parameters affected horizontal air temperature uniformity significantly. Energy utilization coefficient can be greater than one. Relational degree between supply air parameters and temperature uniformity was quantified using grey relational analysis. AbstractIn warm air heating systems, a good indoor air temperature distribution can provide a comfortable indoor environment and reduce energy consumption. Few studies were conducted for the uniformity of air temperature distributions under stratum ventilation (SV) for heating. In this study, the horizontal and vertical air temperature uniformities in an occupied zone were evaluated under SV heating mode. Different indoor thermal environments were created using both experiments and computational fluid dynamics (CFD) simulations. Results showed that the horizontal air temperature uniformity is generally inferior to the vertical direction. Based on the experimental and simulation cases, the maximum horizontal and vertical air temperature gradient is 3.46 °C&#x2F;m and 2.44 °C&#x2F;m, respectively. The uniformity of the air temperature distribution can be significantly affected by supply air parameters. The maximum extremum air temperature difference is 6.26 °C at the height of 0.6 m. However, it can be reduced to less than 0.62 °C by varying the supply air velocity, temperature and angle. Appropriate supply air parameters can provide an energy utilization coefficient (EUC) higher than one, showing the potentials of energy saving. A grey relational analysis revealed that the relational degree of the supply air velocity and temperature on the air temperature uniformity is relatively high, followed by the outdoor temperature and then supply vane angle. The results derived from this study can contribute to better understand the characteristics of indoor air temperature distribution under SV heating mode. Fig. 1. Setup of test chamber. (1: thermal manikin, 2: desk, 3: double deflection grille diffusers (air inlets), 4: air outlets, 5: lamp, 6: right wall) Fig. 5. Local air temperature at heights of 0.1 m, 0.6 m, 1.1 m, and 1.7 m in the three experimental cases Fig. 9. Horizontal distribution of air temperature in Case 12 (Z = 0.6 m) Fig. 12. Vertical distribution of air temperature in Case 1 (X = 1.25 m) ConclusionsIn this study, the uniformity of the air temperature distributions in the occupied zone of an SV heated room was studied based on the experimental and numerical simulation methods. The relational grades for three air supply parameters (supply air temperature, supply air velocity, and supply vane angle) and the outdoor environment (exterior wall temperature) with regard to the vertical and horizontal air temperature uniformities were obtained based on a GRA. The main conclusions are as follows: The maximum non-uniformity occurs at the height of 0.6 m in the occupied zone, the SD attains 1.49 °C, and the extremum air temperature difference is 6.26 °C. The best uniformity is observed at 1.7 m, with an SD of 0.14 °C and extremum temperature difference of 0.62 °C. The average maximum air temperature gradient in each plane in the horizontal direction ΔTh is 3.46 °C&#x2F;m. The average maximum air temperature gradient in the vertical direction ΔTv is 2.44 °C&#x2F;m. The temperature uniformity in the horizontal direction is inferior to that in the vertical direction. Among the sixteen simulation cases, the EUC of thirteen cases is higher than one and the maximum value is 1.23. This shows that SV can achieve energy savings under heating mode. However, when the coupling of supply air parameters is ineffective, the EUC can be less than one. Therefore, it is crucial to pay attentions to the reasonable selection of ventilation parameters for achieving a more uniform temperature distribution, more comfortable indoor environment, and more energy-efficient system operation. With regard to the uniformity of the vertical and horizontal air temperature distributions in the SV heated room, the influences of the supply air velocity and supply air temperature are relatively larger. These are followed by the exterior wall temperature and then the supply vane angle. Paper PDF Viewer Previous Page: / Next import { getDocument, GlobalWorkerOptions } from '/js/pdfjs/pdf.mjs'; var url = \"/files/paper1.pdf\"; var pdfDoc = null; var pageNum = 1; var pageRendering = false; var pageNumPending = null; var scale = 1.5; var canvas = document.getElementById('pdf-viewer'); var ctx = canvas.getContext('2d'); function renderPage(num) { pageRendering = true; pdfDoc.getPage(num).then(function(page) { var viewport = page.getViewport({ scale: scale }); canvas.width = viewport.width; canvas.height = viewport.height; var renderContext = { canvasContext: ctx, viewport: viewport }; var renderTask = page.render(renderContext); renderTask.promise.then(function() { pageRendering = false; if (pageNumPending !== null) { renderPage(pageNumPending); pageNumPending = null; } }); }); document.getElementById('page-num').textContent = num; } function queueRenderPage(num) { if (pageRendering) { pageNumPending = num; } else { renderPage(num); } } window.prevPage = function() { if (pageNum = pdfDoc.numPages) return; pageNum++; queueRenderPage(pageNum); }; GlobalWorkerOptions.workerSrc = \"/js/pdfjs/pdf.worker.mjs\"; getDocument(url).promise.then(function(pdfDoc_) { pdfDoc = pdfDoc_; document.getElementById('page-count').textContent = pdfDoc.numPages; renderPage(pageNum); });"},{"title":"Main effects and interactions of multiple key factors related to thermal perception","date":"2021-07-24T07:49:29.000Z","updated":"2025-03-14T15:08:24.996Z","comments":true,"path":"Paper/Paper11/index.html","permalink":"https://lyu2patrick.github.io/Paper/Paper11/index.html","excerpt":"","text":"AuthorsYuxin Yanga, Junmeng Lyua, Heng Dua, Zhiwei Liana, Weiwei Liub, Lin Duanmuc, Yongchao Zhaid, Bin Caoe, Yufeng Zhangf, Xiang Zhoug, Zhaojun Wangh, Xiaojing Zhangi, Fang Wangj a Department of Architecture, School of Design, Shanghai Jiao Tong University, Shanghai 200240, China b School of Energy Science and Engineering, Central South University, Changsha, Hunan 410083, China c School of Civil Engineering, Dalian University of Technology, Dalian, Liaoning Province 116024, China d College of Architecture, Xi’an University of Architecture and Technology, Xi’an, Shaanxi 710055, China e Department of Building Science, School of Architecture, Tsinghua University, Beijing 100084, China f State Key Laboratory of Subtropical Building Science, Department of Architecture, South China University of Technology, Wushan, Guangzhou 510640, China g School of Mechanical Engineering, Tongji University, Shanghai 200092, China h School of Architecture, Harbin Institute of Technology, Harbin, Heilongjiang Province 150090, China i College of Architecture and Civil Engineering, Beijing University of Technology, Beijing 100124, China j School of Energy and Environment, Zhongyuan University of Technology, Zhengzhou 450007, China https://doi.org/10.1016/j.scitotenv.2024.170683 Highlights Air temperature is the primary factor affecting thermal sensation and comfort. Interaction effects between other factors and air temperature are significant. Find certain reasons for thermal discomfort in thermal neutrality state • New evidence for distinction between thermal sensation and thermal comfort AbstractThe real indoor environment involves the comprehensive interaction of multiple factors, and human subjective responses to different factors are influenced by various aspects such as physics, physiology, and psychology. The relative significance of various factors influencing different types of human subjective thermal perception, as well as the extent of their interactions, remains somewhat unclear. This investigation, leveraging the “Chinese Thermal Comfort Dataset,” analyzed the integrated impact of basic thermal perception factors—temperature, humidity, air speed, as well as clothing insulation and metabolic rate—on subjective thermal perception. The findings underscored the definitive role of air temperature as the primary determinant of thermal sensation, with the impact of other factors generally remaining below 15 % of temperature. Nonetheless, the sensitivity of thermal sensation to temperature is significantly affected by other factors, demonstrating a significant interaction between temperature and different factors in influencing temperature sensation. Additionally, it was observed that significant differences (p &lt; 0.001) in thermal comfort levels existed even at the same thermal sensation. For instance, in the state of thermal neutrality, occupants with relatively higher clothing insulation reported higher thermal comfort level (d &#x3D; 0.40, p &lt; 0.001) during the cooling season but lower thermal comfort level (d &#x3D; 0.54, P &lt; 0.001) during the heating season. Consequently, it can be deduced that when comprehensively considering the impact of multiple factors, evaluating the environment solely based on thermal sensation or thermal neutrality may prove insufficient. Figures Fig. 1. The categorization and probability representation of thermal neutrality and thermal comfort ​ Fig. 3. Factor rankings for Warm and Cool Biased ​ Fig. 4.The interaction effects between Ta and RH (a), Va (b) ​ ​ Fig. 7. Impact of Va (a), MET (b), Iclo (c) on thermal comfort ​ Fig.8. HSWW, cooling season, thermal neutrality rate and thermal comfort rate. ConclusionsBased on the Chinese thermal comfort database, an evaluation was conducted on the impact of key fundamental factors related to thermal perception —air temperature, air speed, relative humidity, metabolic rate, and clothing insulation—on human subjective responses. By comparing the influence and interactions of each factor on thermal sensation and comfort, the main conclusions are as follows: In real indoor environments, air temperature is the primary factor affecting thermal sensation and thermal comfort. The impact of other factors on thermal sensation is generally &lt;15 % compared to temperature, and the influence on thermal comfort may be slightly larger but generally does not exceed 30 %. Temperature sensitivity was employed to assess the interaction between various factors and air temperature. The results reveal significant interaction effects between different factors and air temperature. Both increased air velocity and metabolic rate are associated with higher temperature sensitivity, with temperature sensitivity in Level-2 approximately 0.025–0.047&#x2F;°C higher than that in Level-1. The impact of clothing insulation and relative humidity varies across different seasons. Under the influence of different factors, there are significant differences in thermal comfort even at the same thermal sensation. The impact of these factors is more pronounced during the cooling season, with higher air velocity, humidity, and metabolic rate, as well as lower clothing insulation, contribute to a reduction in comfort levels, even within the thermal neutrality. Therefore, when considering the combined effects of multiple factors, relying solely on thermal sensation or thermal neutrality to evaluate thermal environments may be insufficient. As temperature changes, both thermal comfort rates and thermal neutrality rates are influenced by various factors. Notably, during the cooling season and transitional seasons, thermal comfort rates experience a more significant decrease compared to thermal neutrality rates, particularly due to excessive relative humidity and higher metabolic rates. Paper PDF Viewer Previous Page: / Next import { getDocument, GlobalWorkerOptions } from '/js/pdfjs/pdf.mjs'; var url = \"/files/paper11.pdf\"; var pdfDoc = null; var pageNum = 1; var pageRendering = false; var pageNumPending = null; var scale = 2; var canvas = document.getElementById('pdf-viewer'); var ctx = canvas.getContext('2d'); function renderPage(num) { pageRendering = true; pdfDoc.getPage(num).then(function(page) { var viewport = page.getViewport({ scale: scale }); canvas.width = viewport.width; canvas.height = viewport.height; var renderContext = { canvasContext: ctx, viewport: viewport }; var renderTask = page.render(renderContext); renderTask.promise.then(function() { pageRendering = false; if (pageNumPending !== null) { renderPage(pageNumPending); pageNumPending = null; } }); }); document.getElementById('page-num').textContent = num; } function queueRenderPage(num) { if (pageRendering) { pageNumPending = num; } else { renderPage(num); } } window.prevPage = function() { if (pageNum = pdfDoc.numPages) return; pageNum++; queueRenderPage(pageNum); }; GlobalWorkerOptions.workerSrc = \"/js/pdfjs/pdf.worker.mjs\"; getDocument(url).promise.then(function(pdfDoc_) { pdfDoc = pdfDoc_; document.getElementById('page-count').textContent = pdfDoc.numPages; renderPage(pageNum); });"},{"title":"Occupant-centric cabin thermal sensation assessment system based on low-cost thermal imaging","date":"2021-07-24T07:49:29.000Z","updated":"2025-03-14T15:10:00.460Z","comments":true,"path":"Paper/Paper12/index.html","permalink":"https://lyu2patrick.github.io/Paper/Paper12/index.html","excerpt":"","text":"AuthorsZhenyu Houa c 1, Junmeng Lyub 1, Dongyuan Wua c, Jiangping Chena c, Junye Shia c, Zhiwei Lianb a School of Mechanical Engineering, Shanghai Jiao Tong University, Shanghai, China b School of Design, Shanghai Jiao Tong University, Shanghai, China c Shanghai High Efficient Cooling System Research Center, Shanghai, China 1 These two authors contributed equally and should be considered as co-first authors. https://doi.org/10.1016/j.buildenv.2024.111692 Highlights Developed a non-contact thermal sensation assessment system for cabin occupants. Output of system can drive automatic controls for cabin air conditioner in the future. Developed a simple thermal sensation assessment model for cabin, with an R2 of 0.617 Developed facial region segmentation algorithm for low-resolution thermal imaging. Established system validated with a mean absolute error of 0.49, showing high accuracy. AbstractAssessing cabin occupants’ thermal sensation in real-time enables automatic control of car air conditioning, improving driving safety and energy efficiency. Traditional methods, limited by their need for numerous physiological parameters, have restricted practicality. For this purpose, this study employs a low-cost thermal imaging sensor as the hardware core to establish a cost-effective and non-contact real-time assessment system for the thermal comfort of occupants within a cabin. The system comprises a thermal sensation assessment model developed based on subject experiments, along with facial recognition and segmentation algorithms optimized for thermal images. The thermal sensation assessment model developed, which employs cheek temperature, solar radiation intensity, and cabin air temperature as its features, exhibited an R2 of 0.617 on the test set. Furthermore, the facial recognition algorithm established for thermographic imaging achieved a mean accuracy of 96.5% and a recall rate of 99.0%. The system underwent validation in real-world vehicle environments, proving its ability to accurately detect and measure the cheek temperatures of occupants in the cabin and execute thermal sensation assessments. With a mean absolute error of 0.5 thermal sensation units in its output, its accuracy in practical applications was affirmed. This research provides an effective solution for automatically adjusting cabin air conditioning. Figures Fig. 2. Framework for establishing a cabin thermal sensation assessment system. ​ Fig. 5. Horizontal and vertical facial proportions of human face. ​ Fig. 11. Output of face recognition and key point estimation model. ​ Fig. 12. Performance of the region segmentation (the areas selected by the model are indicated by red boxes). (a) Performance on the building indoor test set, with the actual cheek region delineated by Mediapipe marked in blue. (b) Performance on the on-vehicle test set, with the actual cheek area manually demarcated shown in blue. (c) CRRA under different views. (For interpretation of the references to color in this figure legend, the reader is referred to the Web version of this article.) ​ Fig. 14. Thermal imaging-based cabin occupant thermal sensation assessment system operation interface. ​ Fig. 15. Validation results of the low-cost cabin occupant thermal sensation assessment system output. ConclusionsThis research utilizes low-cost thermal imaging sensors, in-vehicle air temperature sensors, solar radiation sensors, and an onboard computer to construct a system for assessing the thermal sensation of cabin occupants. This system is capable of real-time face recognition, cheek skin temperature extraction, thermal sensation calculation, and real-time display of results. After development, the system was deployed in a vehicle cabin and tested with subjects to validate its performance further. The main conclusions drawn are as follows. A thermal sensation assessment system was established utilizing a low-cost thermal imaging sensor. This system was deployed in vehicles, and its performance was validated through independent validation experiments. The output demonstrated an MAE of 0.5 thermal sensation units, indicating that the system performs effectively overall. A thermal imaging facial cheek temperature extraction algorithm, utilizing YOLO v8 and facial structure characteristics, was developed. The model developed based on this algorithm demonstrated high efficiency in thermal image-based facial recognition, achieving a mean accuracy of 96.5 % and recall of 99.0 %. In the task of cheek segmentation, the model achieved a mean CRRA of 88.9 %. A filtering algorithm further minimized noise-induced data disturbances, yielding a cheek temperature extraction MSE of 0.17. Considering both stability and accuracy of the thermal sensation assessment model, the Elastic Net regression trained using cheek skin temperature, solar radiation intensity, and cabin air temperature, was found to be the best. It achieved an R2 of 0.62 and an MSE of 0.54 on the test set. Paper PDF Viewer Previous Page: / Next import { getDocument, GlobalWorkerOptions } from '/js/pdfjs/pdf.mjs'; var url = \"/files/paper12.pdf\"; var pdfDoc = null; var pageNum = 1; var pageRendering = false; var pageNumPending = null; var scale = 2; var canvas = document.getElementById('pdf-viewer'); var ctx = canvas.getContext('2d'); function renderPage(num) { pageRendering = true; pdfDoc.getPage(num).then(function(page) { var viewport = page.getViewport({ scale: scale }); canvas.width = viewport.width; canvas.height = viewport.height; var renderContext = { canvasContext: ctx, viewport: viewport }; var renderTask = page.render(renderContext); renderTask.promise.then(function() { pageRendering = false; if (pageNumPending !== null) { renderPage(pageNumPending); pageNumPending = null; } }); }); document.getElementById('page-num').textContent = num; } function queueRenderPage(num) { if (pageRendering) { pageNumPending = num; } else { renderPage(num); } } window.prevPage = function() { if (pageNum = pdfDoc.numPages) return; pageNum++; queueRenderPage(pageNum); }; GlobalWorkerOptions.workerSrc = \"/js/pdfjs/pdf.worker.mjs\"; getDocument(url).promise.then(function(pdfDoc_) { pdfDoc = pdfDoc_; document.getElementById('page-count').textContent = pdfDoc.numPages; renderPage(pageNum); });"},{"title":"Application-driven development of a thermal imaging-based cabin occupant thermal sensation assessment model and its validation","date":"2021-07-24T07:49:29.000Z","updated":"2025-03-14T15:10:00.578Z","comments":true,"path":"Paper/Paper14/index.html","permalink":"https://lyu2patrick.github.io/Paper/Paper14/index.html","excerpt":"","text":"AuthorsJunmeng Lyu , Yuxin Yang , Dayi Lai , Li Lan , Zhiwei Lian School of Design, Shanghai Jiao Tong University, Shanghai, China https://doi.org/10.1007/s12273-024-1147-0 AbstractThe air conditioning (A&#x2F;C) of cabins allows for customized control, but manual adjustments may distract drivers, as well as result in energy inefficiency. Several existing thermal sensation models require complex inputs, which are challenging to gather whilst driving. To address this issue, this study developed a non-contact thermal sensation model for cabin occupants based on thermal imaging sensor. To collect actual data used for modeling, an outdoor subject experiment was conducted. In this study, initial training was conducted to compare the performance of six algorithms in building the model, with random forests algorithm showing the best performance. Besides, this study employed the recursive feature elimination (RFE) method with cross-validation algorithm for identifying the key features. In the end, the model was retrained using the selected features. The model that incorporated both environmental parameters and facial-temperature features demonstrated the best performance, with an R2 of 0.659 on the test set. Eliminating the hard-to-measure windshield surface temperature resulted in a slight reduction in accuracy, yielding an R2 of 0.651. To verify the generalizability of the model, this study further conducted independent validation experiments. The selected model, which exhibited a mean absolute error (MAE) of less than 0.4 in thermal sensation units, was proven to be highly applicable. The results can offer new solutions for automatic control of cabin A&#x2F;C. ConclusionsThis study, based on subject experiments, established a summer thermal sensation assessment model for vehicle cabin occupants and conducted performance validation of the established model in independent experiments. The validation confirmed that the model established in this study performs well, with the specific conclusions as follows: Indoor air temperature, windshield surface temperature, the standard deviation of facial skin temperature, cheek skin temperature, solar radiation intensity, and solar elevation angle are important features for establishing a thermal sensation assessment model for vehicle cabin occupants. A model using environmental parameters (indoor air temperature, windshield surface temperature, solar radiation intensity, and solar elevation angle) as well as facial skin temperature information (standard deviation of facial skin temperature, cheek skin temperature) performing the best. From the perspective of practical application, after eliminating the difficult-to-measure feature of windshield surface temperature, the performance slightly decreased but still performed well, with an R2 of 0.651 and an MSE of 0.433 on the test set. In independent validation experiments, the MAE was less than 0.4 thermal sensation units. When the sample size of the training set was 481–578, the MSE of the trained models was relatively low, and the R2 was relatively high. Continuing to enlarge the training size resulted in limited improvement in model performance, while significantly increasing computation and data collection costs. Paper PDF Viewer Previous Page: / Next import { getDocument, GlobalWorkerOptions } from '/js/pdfjs/pdf.mjs'; var url = \"/files/paper14.pdf\"; var pdfDoc = null; var pageNum = 1; var pageRendering = false; var pageNumPending = null; var scale = 2; var canvas = document.getElementById('pdf-viewer'); var ctx = canvas.getContext('2d'); function renderPage(num) { pageRendering = true; pdfDoc.getPage(num).then(function(page) { var viewport = page.getViewport({ scale: scale }); canvas.width = viewport.width; canvas.height = viewport.height; var renderContext = { canvasContext: ctx, viewport: viewport }; var renderTask = page.render(renderContext); renderTask.promise.then(function() { pageRendering = false; if (pageNumPending !== null) { renderPage(pageNumPending); pageNumPending = null; } }); }); document.getElementById('page-num').textContent = num; } function queueRenderPage(num) { if (pageRendering) { pageNumPending = num; } else { renderPage(num); } } window.prevPage = function() { if (pageNum = pdfDoc.numPages) return; pageNum++; queueRenderPage(pageNum); }; GlobalWorkerOptions.workerSrc = \"/js/pdfjs/pdf.worker.mjs\"; getDocument(url).promise.then(function(pdfDoc_) { pdfDoc = pdfDoc_; document.getElementById('page-count').textContent = pdfDoc.numPages; renderPage(pageNum); });"},{"title":"Exploring the correlation and synchronicity between environmental factors and occupant thermal response in dynamic outdoor cabin environments","date":"2021-07-24T07:49:29.000Z","updated":"2025-03-14T15:10:00.238Z","comments":true,"path":"Paper/Paper13/index.html","permalink":"https://lyu2patrick.github.io/Paper/Paper13/index.html","excerpt":"","text":"AuthorsJunmeng Lyu , Yuxin Yang , Dayi Lai , Li Lan , Zhiwei Lian School of Design, Shanghai Jiao Tong University, Shanghai, China https://doi.org/10.1016/j.buildenv.2024.111727 Highlights Evidence for assessing thermal sensation using cheek and nose temperature in cabin Facial temperatures are sensitive to changes in air temperature and relative humidity Thermal sensation is mainly affected by air temperature, followed by solar radiation AbstractTo improve the cabin thermal environment and explore advanced automotive air-conditioning control methods, it is essential to understand the key factors affecting occupant thermal response as well as the synchronicity of the thermal response to environmental changes in outdoor conditions. Given the current gaps in research, this study conducted outdoor experiments in summer to analyze the correlation and synchronicity between the cabin thermal environment and occupant thermal sensation as well as facial skin temperature. Results showed that, during the cooling phases of experiments with high initial cabin air temperatures, occupant thermal sensation improved significantly within 7 min. After 15 min, facial skin temperature and thermal sensation reached quasi-steady states. Thermal sensation was primarily influenced by air temperature, followed by solar radiation, and exhibited significant synchronicity with changes in these factors. When the air temperature stabilized at around 26 °C, every 200 W&#x2F;m2 of solar radiation exposure increased the thermal sensation unit during the 40-min experiment period. Cheek and nose skin temperatures were significantly correlated with air temperature and solar radiation, and were sensitive to environmental changes, synchronizing with changes in air temperature and relative humidity. Further analysis showed the feasibility of using cheek and nose skin temperatures to characterize the occupant thermal sensation in a cabin. Additionally, this study found sex differences in the occupant thermal response in a cabin. The results provide insight into the key optimization parameters for comfort-oriented cabin thermal environment design and offer support for future air conditioning control in cabins based on thermal imaging. Figures Fig. 2. Experiment procedure. ​ Fig. 3. Schematic diagram of the three relationships between two time-varying variables. ​ Fig. 9. Generalized linear mixed model regression results of occupant overall thermal sensation in relation to various factors. ​ Fig. 10. Effects of solar radiation on steady-state overall thermal sensation. ​ Fig. 12. Dynamic changes of facial skin temperature. (a) male (b) female. ​ Fig. 13. Generalized linear mixed model regression results of facial skin temperature of the occupants in relation to various factors. ConclusionsThis research utilizes low-cost thermal imaging sensors, in-vehicle air temperature sensors, solar radiation sensors, and an onboard computer to construct a system for assessing the thermal sensation of cabin occupants. This system is capable of real-time face recognition, cheek skin temperature extraction, thermal sensation calculation, and real-time display of results. After development, the system was deployed in a vehicle cabin and tested with subjects to validate its performance further. The main conclusions drawn are as follows. A thermal sensation assessment system was established utilizing a low-cost thermal imaging sensor. This system was deployed in vehicles, and its performance was validated through independent validation experiments. The output demonstrated an MAE of 0.5 thermal sensation units, indicating that the system performs effectively overall. A thermal imaging facial cheek temperature extraction algorithm, utilizing YOLO v8 and facial structure characteristics, was developed. The model developed based on this algorithm demonstrated high efficiency in thermal image-based facial recognition, achieving a mean accuracy of 96.5 % and recall of 99.0 %. In the task of cheek segmentation, the model achieved a mean CRRA of 88.9 %. A filtering algorithm further minimized noise-induced data disturbances, yielding a cheek temperature extraction MSE of 0.17. Considering both stability and accuracy of the thermal sensation assessment model, the Elastic Net regression trained using cheek skin temperature, solar radiation intensity, and cabin air temperature, was found to be the best. It achieved an R2 of 0.62 and an MSE of 0.54 on the test set. Paper PDF Viewer Previous Page: / Next import { getDocument, GlobalWorkerOptions } from '/js/pdfjs/pdf.mjs'; var url = \"/files/paper13.pdf\"; var pdfDoc = null; var pageNum = 1; var pageRendering = false; var pageNumPending = null; var scale = 2; var canvas = document.getElementById('pdf-viewer'); var ctx = canvas.getContext('2d'); function renderPage(num) { pageRendering = true; pdfDoc.getPage(num).then(function(page) { var viewport = page.getViewport({ scale: scale }); canvas.width = viewport.width; canvas.height = viewport.height; var renderContext = { canvasContext: ctx, viewport: viewport }; var renderTask = page.render(renderContext); renderTask.promise.then(function() { pageRendering = false; if (pageNumPending !== null) { renderPage(pageNumPending); pageNumPending = null; } }); }); document.getElementById('page-num').textContent = num; } function queueRenderPage(num) { if (pageRendering) { pageNumPending = num; } else { renderPage(num); } } window.prevPage = function() { if (pageNum = pdfDoc.numPages) return; pageNum++; queueRenderPage(pageNum); }; GlobalWorkerOptions.workerSrc = \"/js/pdfjs/pdf.worker.mjs\"; getDocument(url).promise.then(function(pdfDoc_) { pdfDoc = pdfDoc_; document.getElementById('page-count').textContent = pdfDoc.numPages; renderPage(pageNum); });"},{"title":"Subjective information in thermal comfort evaluation methods:A critical review","date":"2021-07-24T07:49:29.000Z","updated":"2025-03-14T15:10:00.531Z","comments":true,"path":"Paper/Paper16/index.html","permalink":"https://lyu2patrick.github.io/Paper/Paper16/index.html","excerpt":"","text":"AuthorsYuxin Yanga, Junmeng Lyua, Zhiwei Liana, Yongxin Xiea, Ying Jianga, Junwei Linb, Jianlei Niub Department of Architecture, School of Design, Shanghai Jiao Tong University, Shanghai 200240, China Department of Building Environment and Energy Engineering, The Hong Kong Polytechnic University, Hung Hom, Kowloon, Hong Kong, China https://doi.org/10.1016/j.enbuild.2024.115019 AbstractThermal environments hold significant importance in human living environments, affecting quality of life, work efficiency, and building energy consumption. Accurate evaluation of thermal comfort involves the quantification of subjective information and the establishment of indices and models. Although various thermal comfort evaluation methods currently exist, the complexity of subjective emotions has often been overlooked. This review provides a comprehensive analysis of the underlying purposes and logic behind different thermal comfort evaluation methods, focusing on the intricacies of subjective information. It emphasizes that while substantial studies have already demonstrated that thermal sensation alone is insufficient for evaluating thermal environments in different contexts, there is still an overreliance on thermal sensation by various indices and models. By critically reviewing the role of subjective information in these methods, this review aims to promote the healthy development of thermal comfort evaluation. Figures Fig. 1. Overview diagram of thermal comfort evaluation methods. ​ Fig. 2. Calculation logic of equivalent temperature based on thermophysiology models (using reference condition of SET as an example). ​ Fig. 3. Two types of research frameworks for thermal comfort. ConclusionsThis research utilizes low-cost thermal imaging sensors, in-vehicle air temperature sensors, solar radiation sensors, and an onboard computer to construct a system for assessing the thermal sensation of cabin occupants. This system is capable of real-time face recognition, cheek skin temperature extraction, thermal sensation calculation, and real-time display of results. After development, the system was deployed in a vehicle cabin and tested with subjects to validate its performance further. The main conclusions drawn are as follows. A thermal sensation assessment system was established utilizing a low-cost thermal imaging sensor. This system was deployed in vehicles, and its performance was validated through independent validation experiments. The output demonstrated an MAE of 0.5 thermal sensation units, indicating that the system performs effectively overall. A thermal imaging facial cheek temperature extraction algorithm, utilizing YOLO v8 and facial structure characteristics, was developed. The model developed based on this algorithm demonstrated high efficiency in thermal image-based facial recognition, achieving a mean accuracy of 96.5 % and recall of 99.0 %. In the task of cheek segmentation, the model achieved a mean CRRA of 88.9 %. A filtering algorithm further minimized noise-induced data disturbances, yielding a cheek temperature extraction MSE of 0.17. Considering both stability and accuracy of the thermal sensation assessment model, the Elastic Net regression trained using cheek skin temperature, solar radiation intensity, and cabin air temperature, was found to be the best. It achieved an R2 of 0.62 and an MSE of 0.54 on the test set. Paper PDF Viewer Previous Page: / Next import { getDocument, GlobalWorkerOptions } from '/js/pdfjs/pdf.mjs'; var url = \"/files/paper16.pdf\"; var pdfDoc = null; var pageNum = 1; var pageRendering = false; var pageNumPending = null; var scale = 2; var canvas = document.getElementById('pdf-viewer'); var ctx = canvas.getContext('2d'); function renderPage(num) { pageRendering = true; pdfDoc.getPage(num).then(function(page) { var viewport = page.getViewport({ scale: scale }); canvas.width = viewport.width; canvas.height = viewport.height; var renderContext = { canvasContext: ctx, viewport: viewport }; var renderTask = page.render(renderContext); renderTask.promise.then(function() { pageRendering = false; if (pageNumPending !== null) { renderPage(pageNumPending); pageNumPending = null; } }); }); document.getElementById('page-num').textContent = num; } function queueRenderPage(num) { if (pageRendering) { pageNumPending = num; } else { renderPage(num); } } window.prevPage = function() { if (pageNum = pdfDoc.numPages) return; pageNum++; queueRenderPage(pageNum); }; GlobalWorkerOptions.workerSrc = \"/js/pdfjs/pdf.worker.mjs\"; getDocument(url).promise.then(function(pdfDoc_) { pdfDoc = pdfDoc_; document.getElementById('page-count').textContent = pdfDoc.numPages; renderPage(pageNum); });"},{"title":"Energy saving first or productivity first? — Maximize the economic benefits of urban office buildings","date":"2021-07-24T07:49:29.000Z","updated":"2025-03-14T15:10:00.508Z","comments":true,"path":"Paper/Paper15/index.html","permalink":"https://lyu2patrick.github.io/Paper/Paper15/index.html","excerpt":"","text":"AuthorsYongxiang Shi a b, Junmeng Lyu a , Julie T. Miao b , Zhiwei Lian a c , Li Lan a a School of Design, Shanghai Jiao Tong University, Shanghai, China b Faculty of Architecture, Building and Planning, University of Melbourne, Victoria, Australia c China Institute of Urban Governance, Shanghai Jiao Tong University, Shanghai, China https://doi.org/10.1016/j.enbuild.2024.114629 Highlights Productivity-first maximizes the economic benefits of urban office buildings. The benefits of productivity far outweigh the costs of increased energy consumption nowadays. The optimal indoor environment is correlated with the local economic status. Minor adjustments to productivity model substantially impact economical calculation. AbstractThe enhancement of the indoor environment could typically enhance user productivity; however, it may also result in additional energy consumption. In order to address the trade-off between employee productivity and energy consumption in office buildings for maximizing economic benefits, this study conducted an investigation on the optimal indoor environmental parameters including temperature, humidity, and ventilation rate. The relation between cognitive performance and the environment was established at the laboratory experiment, while the relation between energy consumption and the environment was determined through energy consumption simulation. By linking productivity to energy consumption using economic indicators, the optimal environmental parameters for maximizing economic benefits are calculated. The results indicate that the optimal indoor environment settings for maximum economic benefits are very similar to those for achieving maximum productivity. Prioritizing office workers’ productivity assurance is crucial when designing air conditioning parameters for office buildings to enhance overall economic gains. However, as the ratio of economic-output-to-electricity-price decreases, there is a gradual increase in differences between these two sets of parameters. Therefore, it is more meaningful for economically underdeveloped regions to establish optimal office building parameters by considering energy saving factors more comprehensively. It is also suggested that the validity of the economic optimization results can be further enhanced by developing productivity evaluating methods for real-life office settings and employing more accurate fitting models. Figures Fig. 2. The architectural layout of the office building. ​ Fig. 3. The variation of the optimal parameter points set for indoor environments in office buildings across different cities/countries, considering the economic levels. ​ Fig. 4. Two models commonly used to describe changes in cognitive tasks. ConclusionsThe study utilized an office building in Shanghai as a case study and reveals that the optimal indoor environment settings for maximizing economic benefits are the same with those for achieving optimum productivity. Consequently, prioritizing office workers’ productivity is crucial when designing air conditioning parameters for office buildings to enhance overall economic gains.The disparity between indoor environmental parameters that yield maximum economic benefits and those at optimum productivity will progressively widen as the economic-output-to-electricity-price ratio decreases. For economically underdeveloped regions, attaining optimal air conditioning parameters for office buildings by striking a balance between productivity and energy conservation will result in greater advantages.The economic output of office workers significantly outweighs the energy consumption cost of air conditioning. Even minor adjustments to the productivity model can have a substantial impact on the economic calculation results. Therefore, higher requirements are imposed for enhancing evaluation accuracy in terms of productivity, including improving the productivity evaluation method and optimizing the fitting model. Paper PDF Viewer Previous Page: / Next import { getDocument, GlobalWorkerOptions } from '/js/pdfjs/pdf.mjs'; var url = \"/files/paper15.pdf\"; var pdfDoc = null; var pageNum = 1; var pageRendering = false; var pageNumPending = null; var scale = 2; var canvas = document.getElementById('pdf-viewer'); var ctx = canvas.getContext('2d'); function renderPage(num) { pageRendering = true; pdfDoc.getPage(num).then(function(page) { var viewport = page.getViewport({ scale: scale }); canvas.width = viewport.width; canvas.height = viewport.height; var renderContext = { canvasContext: ctx, viewport: viewport }; var renderTask = page.render(renderContext); renderTask.promise.then(function() { pageRendering = false; if (pageNumPending !== null) { renderPage(pageNumPending); pageNumPending = null; } }); }); document.getElementById('page-num').textContent = num; } function queueRenderPage(num) { if (pageRendering) { pageNumPending = num; } else { renderPage(num); } } window.prevPage = function() { if (pageNum = pdfDoc.numPages) return; pageNum++; queueRenderPage(pageNum); }; GlobalWorkerOptions.workerSrc = \"/js/pdfjs/pdf.worker.mjs\"; getDocument(url).promise.then(function(pdfDoc_) { pdfDoc = pdfDoc_; document.getElementById('page-count').textContent = pdfDoc.numPages; renderPage(pageNum); });"},{"title":"Characteristics of PM2.5 emissions from six types of commercial cooking in Chinese cities and their health effects","date":"2021-07-24T07:49:29.000Z","updated":"2025-03-14T14:49:24.643Z","comments":true,"path":"Paper/Paper3/index.html","permalink":"https://lyu2patrick.github.io/Paper/Paper3/index.html","excerpt":"","text":"AuthorsJunmeng Lyua, Yongxiang Shia, Cong Chenb, Xinqiao Zhangb, Wei Chuc, Zhiwei Liana d a School of Design, Shanghai Jiao Tong University, Shanghai, 200240, China b CSSC Cruise Technology Development Co., Ltd., Shanghai, China c Shanghai Waigaoqiao Shipbuilding CO., Ltd., Shanghai, China d China Institute of Urban Governance, Shanghai Jiao Tong University, Shanghai, 200030, China https://doi.org/10.1016/j.envpol.2022.120180 Highlights Teppanyaki kitchen has the highest PM2.5 concentration. Teppanyaki and Chinese kitchens pose highest PM2.5 exposure risks to chefs. PM2.5 concentrations in breathing zones vary greatly when cooking different dishes. Start of Chinese stir-frying and middle to end of pan-frying release the most PM2.5 AbstractCommercial kitchens may pose significant health risks to workers because they generate large quantities of fine particulate matter (PM2.5). In our study, the concentrations and emission rates of PM2.5 in cooking environments were measured for six types of commercial kitchens that used electricity and natural gas (including traditional Chinese kitchens, western kitchens, teppanyaki kitchens, fried chicken kitchens, barbecue kitchens, and hotpot cooking area). Furthermore, a preliminary health risk assessment of the chefs was undertaken using the annual PM2.5 inhalation and PM2.5 deposition rates into the upper airways and tracheobronchial and alveolar regions of the human body. Results showed that cooking in the teppanyaki kitchen generated the highest amount of PM2.5, with a mean emission rate of 7.7 mg&#x2F;min and a mean mass concentration of 850.4 ± 533.4 μg&#x2F;m³ in the breathing zone. Therefore, teppanyaki kitchens pose highest PM2.5 exposure risks to chefs, with the highest rate of PM2.5 deposition in the upper airways (6.38 × 105 μg&#x2F;year), followed by Chinese kitchens. The PM2.5 concentrations and emission rates of each kitchen varied greatly with the dishes cooked. The mean PM2.5 concentration was the highest during Chinese stir-frying, with the peak concentration reaching more than 20,000 μg&#x2F;m3, followed by pan-frying, deep-frying, stewing, and boiling. A rise in PM2.5 concentration was also observed during the start of stir-frying and in the middle to late stages of pan-frying and grilling meat. The results obtained in our study may contribute in understanding the characteristics of PM2.5 emissions from various types of commercial kitchens and their health effects. Graphical abstract Figures Fig. 1. Real-time PM2.5 concentrations at measuring points 1 and 2 during measurement in six types of kitchens ​ Fig. 2. Non-linear fit of PM2.5 decay rates after cooking in six types of kitchens. tp is the time after stopping cooking. C2 (tp) is PM2.5 concentration at point 2 at tp (grey triangle) ​ Fig. 5. Comparison of the results of our study with those of existing studies ConclusionsIndoor PM2.5 concentrations and emission rates in six commercial kitchens during cooking were investigated using real-time field measurements. The PM2.5 concentration in the breathing zones of commercial cooking environments decreased as follows: teppanyaki kitchen (850.4 ± 533.4 μg&#x2F;m³) ＞ Chinese kitchen (679.1 ± 1922.5 μg&#x2F;m³) ＞ western kitchen (272.2 ± 250.1 μg&#x2F;m³) ＞ fried chicken kitchen (257.2 ± 44.5 μg&#x2F;m³) ＞ barbecue kitchen (146.6 ± 59.8 μg&#x2F;m³) ＞ hotpot cooking area (110.8 ± 24.9 μg&#x2F;m³). PM2.5 concentrations in all the tested kitchens far exceeded the recommended values provided by the WHO. The high concentration of PM2.5 in the commercial kitchens puts chefs at higher health risks, especially in the teppanyaki and Chinese kitchens. The real-time PM2.5 data show that PM2.5 concentrations and emission rates in each kitchen varied greatly when cooking different dishes. The mean PM2.5 concentration during Chinese stir-frying was the highest, and the peak concentration reached more than 20,000 μg&#x2F;m3, followed by the mean PM2.5 concentration during pan-frying, deep-frying, stewing, and boiling. In addition, PM2.5 concentrations increased greatly in the preliminary stages of stir-frying and in the middle to late stages of pan-frying and grilling meats. Paper PDF Viewer Previous Page: / Next import { getDocument, GlobalWorkerOptions } from '/js/pdfjs/pdf.mjs'; var url = \"/files/paper3.pdf\"; var pdfDoc = null; var pageNum = 1; var pageRendering = false; var pageNumPending = null; var scale = 1.5; var canvas = document.getElementById('pdf-viewer'); var ctx = canvas.getContext('2d'); function renderPage(num) { pageRendering = true; pdfDoc.getPage(num).then(function(page) { var viewport = page.getViewport({ scale: scale }); canvas.width = viewport.width; canvas.height = viewport.height; var renderContext = { canvasContext: ctx, viewport: viewport }; var renderTask = page.render(renderContext); renderTask.promise.then(function() { pageRendering = false; if (pageNumPending !== null) { renderPage(pageNumPending); pageNumPending = null; } }); }); document.getElementById('page-num').textContent = num; } function queueRenderPage(num) { if (pageRendering) { pageNumPending = num; } else { renderPage(num); } } window.prevPage = function() { if (pageNum = pdfDoc.numPages) return; pageNum++; queueRenderPage(pageNum); }; GlobalWorkerOptions.workerSrc = \"/js/pdfjs/pdf.worker.mjs\"; getDocument(url).promise.then(function(pdfDoc_) { pdfDoc = pdfDoc_; document.getElementById('page-count').textContent = pdfDoc.numPages; renderPage(pageNum); });"},{"title":"Analysis of occupant thermal comfort and energy-saving potential based on cooling behaviors in residential buildings:A case study of Shanghai","date":"2021-07-24T07:49:29.000Z","updated":"2025-03-14T12:47:15.472Z","comments":true,"path":"Paper/Paper18/index.html","permalink":"https://lyu2patrick.github.io/Paper/Paper18/index.html","excerpt":"","text":"AuthorsJunmeng Lyua, Yuxin Yanga, Dayi Laia, Li Lana, Zisheng Zhaob c, Heng Dud, Zhiwei Liana e Department of Architecture, School of Design, Shanghai Jiao Tong University, Shanghai, China School of Mechanical Engineering, Shanghai Jiao Tong University, Shanghai, China Guangdong Midea Air-Conditioning Equipment Co., Ltd. Guangdong, China Department of Built Environment, National University of Singapore, Singapore China Institute of Urban Governance, Shanghai Jiao Tong University, Shanghai, 200030, China https://doi.org/10.1016/j.buildenv.2025.112792 Highlights Developed a framework for analyzing cooling behavior in residential buildings. The framework automatically generate comfort set point schedule of air conditioner. Occupants’ comfort indoor air temperatures dynamically adapt to outdoor climate. The framework applied to 920 ACs in Shanghai can achieve 11.04 % energy savings. AbstractBuildings account for a significant share of global energy consumption and carbon emissions, with the cooling sector representing a critical challenge in achieving net-zero emissions. The urgent need lies in developing strategies that effectively balance cooling energy efficiency with thermal comfort of building occupants. The development of the Internet of Things has made it possible to collect users’ cooling usage data. Mining historical data for thermal comfort analysis, thermal environment control and fine-scale energy consumption prediction is a promising approach, but research gaps remain. To implement this approach, this study develops a Residential Cooling Behavior Analytics Framework (RE-CBA), which leverages IoT-enabled air conditioner data to optimize cooling performance. By analyzing usage patterns, identifying cooling periods, and modeling user-specific comfort temperatures, the RE-CBA framework generates personalized setpoint schedules for automatic air conditioner control. Integrated with building energy simulations, it quantifies energy performance under dynamic controls. Applying the RE-CBA framework to 920 air conditioners in Shanghai, the results reveal diverse individual comfort preferences. Personalized control strategies derived from the framework resulted in an 11.04% energy saving (ΔE &#x3D; 116,657 kWh) compared to the static 26 °C baseline. By uniting real-time data insights with occupant-centric control strategies, this framework advances both thermal comfort and energy efficiency. With its scalability and ease of adoption, the RE-CBA framework offers an effective pathway to sustainable cooling in urban residential buildings. Figures Fig. 1. Residential cooling behavior analytics framework (RE-CBA) for occupant-centric control and its energy-saving potential evaluation. ​ Fig. 2. Characteristics of thermostat setpoint adjustments (samples selected with operating durations ≤ Q3, 75th percentile). a. Magnitude of setpoint increases and decreases following A/C switch-on. b. Frequency of setpoint adjustment operations at 0, 2, 5, 10, 20, and 40 mins after A/C switch-on. ​ Fig. 3. Monthly distribution of indoor air temperatures triggering air conditioner on/off events. The upper illustrates the trigger temperatures for switching on air conditioners. The lower depicts the trigger temperatures for switching off air conditioners. ​ Fig. 4. Air conditioner usage duration statistics and daily outdoor air temperature. a. Daily outdoor air temperature throughout the study period. b. Daily average air conditioner usage duration. c. Hourly average air conditioner usage rate (usage duration/24 h). ​ Fig. 5. Hourly average usage probability of each cluster group following K-means clustering analysis. ​ Fig. 6. User comfortable indoor air temperature. a. Daily comfortable indoor air temperature and corresponding outdoor air temperature. b. Relationship between daily comfortable indoor air temperature and outdoor air temperature (From May 15th to Sept 15th). c. Linear regression results for four representative users. ​ Fig. 8. Simulation results of total energy consumption during the cooling season for different air conditioner samples in the dataset. ConclusionsAs global cooling demands rise, balancing occupant thermal comfort with energy efficiency has become a critical challenge in residential buildings. In smart residential buildings, automation of cooling systems is key to providing occupant comfort without requiring manual adjustments, while capturing energy-saving opportunities. This study develops an analytics framework for historical air conditioning usage behavior, aimed at automatically generating personalized and comfortable air conditioning settings. Based on the framework, a case study in Shanghai was conducted. The conclusions are as follows: Cooling periods, usage scenarios, and personalized indoor air temperature preferences can be derived from IoT-enabled air conditioner usage data. These could be further used to drive air conditioner automatic control and to optimize energy simulation in residential buildings. Based on this, this study developed an occupant-centric residential cooling behavior analytics framework (RE-CBA) to realize this information extraction procedure. Application of the RE-CBA framework to a dataset of 920 residential air conditioners in Shanghai revealed that users’ comfortable indoor air temperatures adapt dynamically to outdoor conditions, increasing with rising outdoor air temperatures. This supports adaptive thermal comfort theory and making adaptive theory could be practically used for automatic control without relying on subjective feedback. Energy simulations of the case study dataset demonstrated that the personalized control strategy derived from the framework, when compared to a fixed setpoint of 26 °C, more effectively aligns with users’ adaptive thermal behaviors. Across the 920 air conditioner samples in the dataset, the personalized control strategy resulted in an 11.04 % energy savings (ΔE &#x3D; 116,657 kWh) compared to the static 26 °C baseline. Paper PDF Viewer Previous Page: / Next import { getDocument, GlobalWorkerOptions } from '/js/pdfjs/pdf.mjs'; var url = \"/files/paper18.pdf\"; var pdfDoc = null; var pageNum = 1; var pageRendering = true; var pageNumPending = null; var scale = 2; var canvas = document.getElementById('pdf-viewer'); var ctx = canvas.getContext('2d'); function renderPage(num) { pageRendering = true; pdfDoc.getPage(num).then(function(page) { var viewport = page.getViewport({ scale: scale }); canvas.width = viewport.width; canvas.height = viewport.height; var renderContext = { canvasContext: ctx, viewport: viewport }; var renderTask = page.render(renderContext); renderTask.promise.then(function() { pageRendering = false; if (pageNumPending !== null) { renderPage(pageNumPending); pageNumPending = null; } }); }); document.getElementById('page-num').textContent = num; } function queueRenderPage(num) { if (pageRendering) { pageNumPending = num; } else { renderPage(num); } } window.prevPage = function() { if (pageNum = pdfDoc.numPages) return; pageNum++; queueRenderPage(pageNum); }; GlobalWorkerOptions.workerSrc = \"/js/pdfjs/pdf.worker.mjs\"; getDocument(url).promise.then(function(pdfDoc_) { pdfDoc = pdfDoc_; document.getElementById('page-count').textContent = pdfDoc.numPages; renderPage(pageNum); });"},{"title":"Experimental investigation on effects of odor types, concentrations, and release frequencies on cognitive performance","date":"2021-07-24T07:49:29.000Z","updated":"2025-03-14T15:10:00.437Z","comments":true,"path":"Paper/Paper17/index.html","permalink":"https://lyu2patrick.github.io/Paper/Paper17/index.html","excerpt":"","text":"AuthorsYongxiang Shia b, Junmeng Lyua b, Christhina Candidob, Julie Tian Miaob, Zhiwei Liana School of Design, Shanghai Jiao Tong University, Shanghai, China Faculty of Architecture, Building and Planning, University of Melbourne, Melbourne, Australia https://doi.org/10.1016/j.buildenv.2024.111692 Highlights Exposure to aromatic environments improved scores on cognitive tasks. A two-way interaction across 3 factors impacted cognitive performance. Test scores and electroencephalogram demonstrated consistent patterns of change. Optimal environments depend on the cognitive resources required for specific task. AbstractPrevious studies have demonstrated that aromatic environments have the potential to improve cognitive performance. However, there is a lack of continuous exposure experiments relevant to real-world office settings, and insufficient research on the impacts of different affecting factors on cognitive performance. This study recruited 44 participants who were exposed to different odors (rosemary, lemon, and peppermint), various concentrations (odorless, low, and high), and different release frequencies (stable release, 20-min-cycle, and 60-min-cycle) for a duration of 2 h Subsequently, participants completed neurobehavioral ability tests and self-assessments of workload. Electroencephalographic (EEG) data were measured and recorded during the cognitive tasks. The results indicated that different odor types improved cognitive test scores to varying degrees and impacted the relative power spectral density (PSD) of EEG. Test scores and EEG activity generally exhibited consistent trends. Relaxing and soothing aromatic environments were found to improve short-term memory and logical reasoning task scores, while environments that increased brain excitement and alertness improved perceptual task scores. No significant impacts of aromatic environments on subjective workload were observed. Figures Fig. 1. Laboratory layout. ​ Fig. 5. Process for determining which tasks were affected by aromatic environments. ​ Fig. 9. Pairwise comparison of task scores across different odors. (*: p < 0.05, **: p < 0.01, ***: p < 0.005; #: significantly different from baseline with p < 0.05). ​ Fig. 10. Pairwise comparison of task scores between different concentrations. (*: p < 0.05, **: p < 0.01, ***: p < 0.005; #: significantly different from baseline with p < 0.05). ​ Fig. 12. Impacts of interactions on task scores. ​ Fig. 13. Pairwise comparison of EEG power spectrum density of θ, α, and β wave across different channels and lobes. ConclusionsThis study examined the cognitive task scores, self-assessed workload, and EEG activity results of 44 participants exposed to various aromatic environments. The conclusions are outlined as follows: Exposure to aromatic environments can significantly improve cognitive task scores. The impacts of odor type and concentration on cognitive performance vary across different tasks. Compared to intermittent release, a stable aromatic environment results in more pronounced improvements in performance. There is an interaction between concentration and release frequency impacting test scores, with stable release amplifying the positive impacts of concentration. No negative impacts of aromatic environments on cognitive tasks were observed. Aromatic environments significantly impact the relative power spectral density of EEG during cognitive tasks. Exposure to rosemary and lemon scents increases the proportion of θ waves, while peppermint scent increases the proportion of β waves. The interaction between odor type and concentration indicates that increasing the concentration of lemon scent further increases θ waves while decreasing α and β waves. In contrast, increasing the concentration of rosemary and peppermint scents reduces θ waves and increases α and β waves. Additionally, there is an interaction between concentration and release frequency, with peppermint’s release frequency impacting EEG activity differently compared to the other two odors. Differences in self-assessed workload across various aromatic environments are not significant. Test scores and EEG activity generally exhibit consistent patterns of change, making EEG an effective indicator for evaluating the impact of aromatic environments on cognitive performance. Aromatic environments that promote relaxation and calmness improve short-term memory and logical reasoning task performance, while environments that increase brain arousal and alertness improve performance on perceptual tasks. Paper PDF Viewer Previous Page: / Next import { getDocument, GlobalWorkerOptions } from '/js/pdfjs/pdf.mjs'; var url = \"/files/paper17.pdf\"; var pdfDoc = null; var pageNum = 1; var pageRendering = false; var pageNumPending = null; var scale = 2; var canvas = document.getElementById('pdf-viewer'); var ctx = canvas.getContext('2d'); function renderPage(num) { pageRendering = true; pdfDoc.getPage(num).then(function(page) { var viewport = page.getViewport({ scale: scale }); canvas.width = viewport.width; canvas.height = viewport.height; var renderContext = { canvasContext: ctx, viewport: viewport }; var renderTask = page.render(renderContext); renderTask.promise.then(function() { pageRendering = false; if (pageNumPending !== null) { renderPage(pageNumPending); pageNumPending = null; } }); }); document.getElementById('page-num').textContent = num; } function queueRenderPage(num) { if (pageRendering) { pageNumPending = num; } else { renderPage(num); } } window.prevPage = function() { if (pageNum = pdfDoc.numPages) return; pageNum++; queueRenderPage(pageNum); }; GlobalWorkerOptions.workerSrc = \"/js/pdfjs/pdf.worker.mjs\"; getDocument(url).promise.then(function(pdfDoc_) { pdfDoc = pdfDoc_; document.getElementById('page-count').textContent = pdfDoc.numPages; renderPage(pageNum); });"},{"title":"Gender differences in thermal sensation and skin temperature sensitivity under local cooling","date":"2021-07-24T07:49:29.000Z","updated":"2025-03-14T14:44:05.518Z","comments":true,"path":"Paper/Paper2/index.html","permalink":"https://lyu2patrick.github.io/Paper/Paper2/index.html","excerpt":"","text":"AuthorsQiantao Zhaoa 1, Junmeng Lyua 1, Heng Dua, Zhiwei Liana, Zisheng Zhaob a School of Design, Shanghai Jiao Tong University, Shanghai, 200240, China b Guangdong Midea Air-Conditioning Equipment Co., Ltd., Guangdong, 528311, China 1 These two authors contributed equally and should be considered as co-first authors. https://doi.org/10.1016/j.jtherbio.2022.103401 Highlights The best environment for male and female to use local cooling is inconsistent. Back cooling is useful for both genders and foot sole cooling is available for males. Under local cooling, female skin temperature is more sensitive than that of males. Female upper arm skin temperature is most sensitive to TSV and forearm for males. AbstractLocal cooling has proven to be an alternative to traditional comfort air conditioning to ensure users’ thermal comfort while conserving energy. Few studies have investigated the gender differences in the applicable cooling temperatures and the applicable cooling locations and the differences in the sensitivity of skin temperature to thermal sensation under local cooling. Based on the design of orthogonal experiment, nine chamber experiments were conducted through different combinations of ambient temperature, cooling temperature, and cooling location. The subjective questionnaires and objective measurements were obtained in each experimental case. The results showed that the ambient temperature and the cooling location significantly affect the human overall thermal sensation of both genders under local cooling, while cooling temperature and cooling location significantly affect the local thermal sensation. For female, a neutral thermal sensation can be achieved by cooling the back at 24–26 °C when the ambient temperature is 31 °C. Back cooling at 22–26 °C is effective for male when the ambient temperature is 28 °C and 31 °C, and sole cooling with a higher cooling temperature is more acceptable at 34 °C. Moreover, female skin temperature is more sensitive to thermal sensation than that of males under local cooling. The upper arm skin temperature is most sensitive to thermal sensations for female, while the forearm skin temperature is most sensitive for male. Fig. 2. Local cooling device and cooling locations Fig. 6. Overall thermal sensation votes at different cooling locations and ambient temperatures Fig. 9. The mean values of skin temperatures at non-cooled body locations in five overall thermal sensation classification ConclusionsThe conclusions of this study are as follows: Under local cooling, female has a greater variation in thermal sensation than male. In this experiment, male overall TSV is concentrated between 0 (neutral) and 1 (slightly warm), but female overall TSV is dispersed between −2 (cool) and 2 (warm). For both males and females, ambient temperature and cooling location have a significant impact on overall thermal sensation under local cooling, while cooling temperature and cooling location have a significant impact on local thermal sensation. In the three environments with different ambient temperature set up in this study, the best applicable indoor environment with local cooling for female is 31 °C. In this environment, back cooling at 24–26 °C achieves a neutral thermal sensation. Local cooling is applicable for male in all three environments with different ambient temperature set up in this study. Back cooling at 22–26 °C is recommended in 28 °C and 31 °C indoor environments. In a 34 °C environment, foot sole cooling with a higher cooling temperature is preferable. The skin temperatures of female are more sensitive to thermal sensation than that of males under local cooling. The skin temperature of female upper arm is the most sensitive, whereas that for male is the skin temperature of forearm. Paper PDF Viewer Previous Page: / Next import { getDocument, GlobalWorkerOptions } from '/js/pdfjs/pdf.mjs'; var url = \"/files/paper2.pdf\"; var pdfDoc = null; var pageNum = 1; var pageRendering = false; var pageNumPending = null; var scale = 1.5; var canvas = document.getElementById('pdf-viewer'); var ctx = canvas.getContext('2d'); function renderPage(num) { pageRendering = true; pdfDoc.getPage(num).then(function(page) { var viewport = page.getViewport({ scale: scale }); canvas.width = viewport.width; canvas.height = viewport.height; var renderContext = { canvasContext: ctx, viewport: viewport }; var renderTask = page.render(renderContext); renderTask.promise.then(function() { pageRendering = false; if (pageNumPending !== null) { renderPage(pageNumPending); pageNumPending = null; } }); }); document.getElementById('page-num').textContent = num; } function queueRenderPage(num) { if (pageRendering) { pageNumPending = num; } else { renderPage(num); } } window.prevPage = function() { if (pageNum = pdfDoc.numPages) return; pageNum++; queueRenderPage(pageNum); }; GlobalWorkerOptions.workerSrc = \"/js/pdfjs/pdf.worker.mjs\"; getDocument(url).promise.then(function(pdfDoc_) { pdfDoc = pdfDoc_; document.getElementById('page-count').textContent = pdfDoc.numPages; renderPage(pageNum); });"},{"title":"Where should the thermal image sensor of a smart A/C look?-Occupant thermal sensation model based on thermal imaging data","date":"2021-07-24T07:49:29.000Z","updated":"2025-03-14T14:53:21.728Z","comments":true,"path":"Paper/Paper5/index.html","permalink":"https://lyu2patrick.github.io/Paper/Paper5/index.html","excerpt":"","text":"AuthorsJunmeng Lyu, Heng Du, Zisheng Zhao, Yongxiang Shi, Bo Wang, Zhiwei Lian a School of Design, Shanghai Jiao Tong University, Shanghai, 200240, China b Guangdong Midea Air-Conditioning Equipment Co., Ltd, Guangdong, 528311, China https://doi.org/10.1016/j.buildenv.2023.110405 Highlights For evaluating thermal sensation using thermal image sensor, front view is the best. Two-stage model is developed by combining machine learning classifier with regression. The model evaluates thermal sensation via thermal imaging for smart air conditioner. The model takes into account gender differences in surface temperature sensitivity. The mean absolute error of the model is less than 0.5 thermal sensation units. AbstractApplying thermal imaging sensor to air conditioner for monitoring human thermal sensation and achieving dynamic settings may satisfy occupants’ thermal needs while saving energy. The existing studies are mostly based on single-view imaging to build the model and ignore the possible differences in body surface temperature on thermal sensation response by gender, etc., which may have many limitations. Subject experiments were conducted in an artificial climate chamber to obtain subjective questionnaires and thermal images of the exposed frontal face, lateral face, top of the head, forearm, and hand dorsum of 27 subjects in this study. By applying machine learning classification algorithms and global optimal regression algorithms, the temperature collection zones that can accurately reflect the thermal sensation of both genders in each view were analyzed, and a two-stage thermal sensation assessment model applicable to multiple views was developed. Of the various imaging views, the frontal view of the face is the best, followed by the lateral view of the face, the top view of the head, and the forearm&#x2F;hand dorsum view. For male and female, the mean absolute errors of the thermal sensation assessment model established were 0.41–0.49 and 0.50–0.53 thermal sensation units. In addition, gender differences were found in the response of head surface temperatures to thermal sensation. The results obtained can provide a reference for the application of thermal image sensor to smart air conditioners. Graphical abstract Figures Fig. 6. Heat map of Pearson's correlation coefficient between variables. ​ ​ Fig. 7. Linear fitting of non-neutral thermal sensation to the temperature captured by thermal camera ​ ​ Fig. 11. Practical applications and the next steps for future researches. ConclusionsThrough the subject experiment, this study combined machine learning classification algorithms and regression algorithms to analyze the surface temperature collection zones that accurately reflect thermal sensation under different imaging views. Moreover, thermal sensation evaluation two-stage models were established for users of different genders, which are suitable for various thermal imaging views. The main conclusions are as follows: In assessing human thermal sensation via thermal imaging, the most optimal view is the frontal face, followed by the lateral face, the top of the head, and the forearm&#x2F;hand dorsum. The range of temperature differences between facial zones, cheek surface temperature, overhead surface temperature, and forearm surface temperature can be used as indicators for assessing the degree of deviation from neutral thermal sensation. By using the random forest algorithm, using only the cheek temperature from frontal face imaging as a feature can achieve an accuracy rate of 75.0%–78.3% for three-level thermal sensation classification. Adding indoor air temperature and air velocity to the features can increase the accuracy of the classification model to a maximum of 86.7%. The proposed thermal sensation evaluation two-stage model based on thermal imaging has a MAE of 0.41–0.49 thermal sensation units for male and 0.50–0.53 thermal sensation units for female. Paper PDF Viewer Previous Page: / Next import { getDocument, GlobalWorkerOptions } from '/js/pdfjs/pdf.mjs'; var url = \"/files/paper5.pdf\"; var pdfDoc = null; var pageNum = 1; var pageRendering = false; var pageNumPending = null; var scale = 1.5; var canvas = document.getElementById('pdf-viewer'); var ctx = canvas.getContext('2d'); function renderPage(num) { pageRendering = true; pdfDoc.getPage(num).then(function(page) { var viewport = page.getViewport({ scale: scale }); canvas.width = viewport.width; canvas.height = viewport.height; var renderContext = { canvasContext: ctx, viewport: viewport }; var renderTask = page.render(renderContext); renderTask.promise.then(function() { pageRendering = false; if (pageNumPending !== null) { renderPage(pageNumPending); pageNumPending = null; } }); }); document.getElementById('page-num').textContent = num; } function queueRenderPage(num) { if (pageRendering) { pageNumPending = num; } else { renderPage(num); } } window.prevPage = function() { if (pageNum = pdfDoc.numPages) return; pageNum++; queueRenderPage(pageNum); }; GlobalWorkerOptions.workerSrc = \"/js/pdfjs/pdf.worker.mjs\"; getDocument(url).promise.then(function(pdfDoc_) { pdfDoc = pdfDoc_; document.getElementById('page-count').textContent = pdfDoc.numPages; renderPage(pageNum); });"},{"title":"A sleep staging model for the sleep environment control based on machine learning","date":"2021-07-24T07:49:29.000Z","updated":"2025-03-14T14:56:06.137Z","comments":true,"path":"Paper/Paper6/index.html","permalink":"https://lyu2patrick.github.io/Paper/Paper6/index.html","excerpt":"","text":"AuthorsTing Cao, Zhiwei Lian, Heng Du, Jingyun Shen, Yilun Fan, Junmeng Lyu School of Design, Shanghai Jiao Tong University, Shanghai, 200240, China https://doi.org/10.1007/s12273-023-1049-6​ AbstractTo date, dynamic sleep environment has been attracted the focus of researchers. Owing to the individual difference on sleep phase and thermal comfort, changes in sleep environment should be occupant-centered, and precise regulation of the environment required current sleep stages. However, few studies connected occupants and the environment through physiological signal-based model of sleep staging. Therefore, this study tried to develop a data driven sleep staging model with higher accuracy through sleep experiments collecting information. Raw database was processed and selected efficiently according to the characteristics of physiological signals. Finally, the sleep staging model with an average accuracy of 93.9% was built, and other mean indicators (precision: 82.5%, recall: 83.1%, F1 score: 82.8%) performed well. The features adopted by model were found to come from different brain regions, and the global brain signals were suggested to play an important role in the construction of sleep staging model. Moreover, the computational processing of physiology signals should consider their characteristics, i.e., time domain, frequency domain, time-frequency domain and nonlinear characteristics. The model obtained in this study may deliver a credible reference to advance the research on control of sleep environment. ​ Paper PDF Viewer Previous Page: / Next import { getDocument, GlobalWorkerOptions } from '/js/pdfjs/pdf.mjs'; var url = \"/files/paper6.pdf\"; var pdfDoc = null; var pageNum = 1; var pageRendering = false; var pageNumPending = null; var scale = 1.5; var canvas = document.getElementById('pdf-viewer'); var ctx = canvas.getContext('2d'); function renderPage(num) { pageRendering = true; pdfDoc.getPage(num).then(function(page) { var viewport = page.getViewport({ scale: scale }); canvas.width = viewport.width; canvas.height = viewport.height; var renderContext = { canvasContext: ctx, viewport: viewport }; var renderTask = page.render(renderContext); renderTask.promise.then(function() { pageRendering = false; if (pageNumPending !== null) { renderPage(pageNumPending); pageNumPending = null; } }); }); document.getElementById('page-num').textContent = num; } function queueRenderPage(num) { if (pageRendering) { pageNumPending = num; } else { renderPage(num); } } window.prevPage = function() { if (pageNum = pdfDoc.numPages) return; pageNum++; queueRenderPage(pageNum); }; GlobalWorkerOptions.workerSrc = \"/js/pdfjs/pdf.worker.mjs\"; getDocument(url).promise.then(function(pdfDoc_) { pdfDoc = pdfDoc_; document.getElementById('page-count').textContent = pdfDoc.numPages; renderPage(pageNum); });"},{"title":"Gender differences in thermal comfort under coupled environmental factors","date":"2021-07-24T07:49:29.000Z","updated":"2025-03-14T14:58:31.452Z","comments":true,"path":"Paper/Paper7/index.html","permalink":"https://lyu2patrick.github.io/Paper/Paper7/index.html","excerpt":"","text":"AuthorsHeng Du, Zisheng Zhao, Junmeng Lyu, Jinbo Li, Zhiqiang liu, Xiangyang Li, Yuxin Yang, Li Lan, Zhiwei Lian a School of Design, Shanghai Jiao Tong University, Shanghai, 200240, China b Guangdong Midea Air-Conditioning Equipment Co., Ltd, Guangdong, 528311, China https://doi.org/10.1016/j.enbuild.2023.113345 AbstractThis paper aims to explore gender differences in thermal comfort under coupled environmental factors, as previous studies have primarily focused on air temperature alone. The experiment involved 27 subjects, 13 males and 14 females, who experienced 12 different combinations of air temperature and air velocity environmental conditions. The subjective responses and physiological parameters were collected and analyzed. In colder environments, especially when low air temperatures are coupled with elevated air velocity, significant gender differences are observed, as females feel colder, more uncomfortable, and perceive stronger drafts than males. In hotter environments, when high air temperatures are coupled with still air, males tend to feel more uncomfortable and prefer higher air velocity, compared to females. However, few gender differences are observed when high air temperatures are coupled with elevated air velocity. Under colder conditions, forearm temperatures show a stronger correlation with subjective responses, while under hotter conditions, facial skin temperatures demonstrate a stronger correlation, for both genders. Moreover, the Elevated Air Speed Model in ASHRAE 55–2020 is found to overestimates the cooling effect of elevated air velocity for both genders. The findings suggest that gender differences should be properly considered when designing indoor thermal environments, particularly under colder conditions. Figures Fig. 2. Comparison of thermal sensation between males and females ​ Fig. 8. Interaction between gender and air velocity at different air temperature levels ​ Fig. 11. Correlation between subjective responses and skin temperatures under hotter conditions ​ Fig. 13. Evaluation the prediction of cooling effect model in ASHRAE 55–2020 ConclusionsThis paper explores gender differences in thermal comfort under coupled air temperature and air velocity conditions, based on subjective responses and objective physiological parameters. The findings suggest that gender differences in thermal comfort are not straightforward and may depend on the interaction effects of multiple thermal environmental factors. The results are summarized as follows: In a colder environment, especially under coupled low air temperature and elevated air velocity condition, there are significant gender differences in thermal comfort. Females feel colder, more discomfort, and perceive stronger draft, compared to males. In a hotter environment, when high air temperature is coupled with still air velocity, males tend to feel more discomfort and prefer higher air velocity, compared to females. When high air temperature is coupled with elevated air velocity, however, there are few gender differences in thermal comfort. Under coupled air temperature and air velocity conditions, the correlation between forearm skin temperatures and subjective responses is stronger in colder environments, while the correlation between facial skin temperatures and subjective responses is stronger in hotter environments, for both males and females. Existing thermal comfort models often overestimate the impact of environmental factors on the subjective responses and do not account for gender differences, which can lead to errors in practical application. It is recommended that gender differences should be properly considered in the design of thermal environments, especially to avoid the combination of low air temperature and high air velocity that can cause discomfort for females. Paper PDF Viewer Previous Page: / Next import { getDocument, GlobalWorkerOptions } from '/js/pdfjs/pdf.mjs'; var url = \"/files/paper7.pdf\"; var pdfDoc = null; var pageNum = 1; var pageRendering = false; var pageNumPending = null; var scale = 1.5; var canvas = document.getElementById('pdf-viewer'); var ctx = canvas.getContext('2d'); function renderPage(num) { pageRendering = true; pdfDoc.getPage(num).then(function(page) { var viewport = page.getViewport({ scale: scale }); canvas.width = viewport.width; canvas.height = viewport.height; var renderContext = { canvasContext: ctx, viewport: viewport }; var renderTask = page.render(renderContext); renderTask.promise.then(function() { pageRendering = false; if (pageNumPending !== null) { renderPage(pageNumPending); pageNumPending = null; } }); }); document.getElementById('page-num').textContent = num; } function queueRenderPage(num) { if (pageRendering) { pageNumPending = num; } else { renderPage(num); } } window.prevPage = function() { if (pageNum = pdfDoc.numPages) return; pageNum++; queueRenderPage(pageNum); }; GlobalWorkerOptions.workerSrc = \"/js/pdfjs/pdf.worker.mjs\"; getDocument(url).promise.then(function(pdfDoc_) { pdfDoc = pdfDoc_; document.getElementById('page-count').textContent = pdfDoc.numPages; renderPage(pageNum); });"},{"title":"How do people set air conditioning temperature setpoint in urban domestic–Behavior model in Chinese three climate zones based on historical usage data","date":"2021-07-24T07:49:29.000Z","updated":"2025-03-14T14:50:52.645Z","comments":true,"path":"Paper/Paper4/index.html","permalink":"https://lyu2patrick.github.io/Paper/Paper4/index.html","excerpt":"","text":"AuthorsJunmeng Lyu, Jinbo Li, Zisheng Zhao, Xiongwei Miao, Heng Du, Dayi Lai, Yuxin Yang, Zhiwei Lian a School of Design, Shanghai Jiao Tong University, Shanghai 200240, China b China Institute of Urban Governance, Shanghai Jiao Tong University, Shanghai 200030, China c Guangdong Midea Air-Conditioning Equipment Co., Ltd., Guangdong, China https://doi.org/10.1016/j.enbuild.2023.112856 AbstractPredicting user behavior in setting air conditioning (A&#x2F;C) can help develop automatic A&#x2F;C control techniques, but it is challenging. Existing studies have largely focused on A&#x2F;C switching behavior models, with fewer studies exploring temperature-setting behavior models in various climate zones. This study analyzed differences in household A&#x2F;C temperature setpoint behaviors in three climate zones, using usage data collected from embedded sensors in A&#x2F;C during the cooling season. Further, five machine learning (ML) algorithms were applied to model the A&#x2F;C temperature setpoint behavior for the three climate zones. The results showed that the behavior is related to time, indoor air temperature (Tin), outdoor air temperature (Tout), temperature setpoint before settings (Tset’), and cumulative time the A&#x2F;C is turned on (tc). A&#x2F;C usage behavior varied significantly among users in different climate zones. Users in hot summer and warm winter (HSWW) have a higher acceptable Tin and the opposite in Cold zones. In HSWW zones, users were able to find their preferred setting temperature more quickly. By applying the random forest algorithm and proper data pre-processing, the model can predict the “Warmer”, “Keep setpoint unchanged” and “Cooler” settings with 0.700–0.810 macro F1 score and 0.936–0.961 accuracy. This shows the excellent performance of ML algorithms in predicting user behavior with large data sizes. The Tin, Tset’, and tc are important input features. This work aims to model A&#x2F;C temperature setpoint behavior through ML algorithms to help develop intelligent A&#x2F;C control methods for different climate zones in the future. Figures Fig. 1. Location of the sample devices ​ Fig. 2. Diagram of modeling of A/C temperature setpoint behavior ​ Fig. 3. Percentage of each A/C temperature setpoint ​ Fig. 4. Relationship between indoor temperature, outdoor temperature, and A/C temperature setpoint ​ ​ Fig. 9. Grid search for tuning parameters ​ ​ Fig. 14. An intelligent A/C control strategy based on temperature setpoint behavior model ConclusionsBased on a large sample size of the A&#x2F;C usage dataset, this study analyzed the A&#x2F;C temperature setpoint behavior of users and built the A&#x2F;C temperature setpoint behavior model for the three climate zones by ML algorithms. The study found that the urban household A&#x2F;C temperature setpoint behavior is related to the time, Tin, Tout, tc, and Tset’. In the HSWW zone, 15 % of the samples had setpoints below 24 °C, which was about three times higher than the other two zones. In the HSCW and HSWW zones, Tin showed a weaker linear correlation with the Tset’, but a higher correlation with Tout compared to the Cold zone. Users in HSWW zones have a higher range of acceptable Tin during the summer months, while the opposite is observed in Cold zones. Notably, users in HSWW zones can find the preferred temperature setpoint more quickly after turning on A&#x2F;C. Based on these analysis results, five ML algorithms were used to develop A&#x2F;C temperature setpoint models for three climate zones, and the performance of the different algorithms was compared. By applying the RF algorithm and proper data preprocessing, the binary classification model can predict the “Warmer” and “Cooler” settings with 0.793–0.909 macro F1 score and 0.794–0.909 accuracy. The three-classification model can predict the “Warmer”, “NC” and “Cooler” settings with 0.700–0.810 macro F1 score and 0.936–0.961 accuracy. The Tin, tc, and Tset’ are important input features. The climate-sensitive model proposed in this study has better prediction performance than the model without distinguishing climate zones. Finally, the practical applications of the models proposed in this study were presented. In the future, the model proposed in this study can be combined with other thermal comfort models to optimize the A&#x2F;C system for both thermal comfort and energy efficiency. Paper PDF Viewer Previous Page: / Next import { getDocument, GlobalWorkerOptions } from '/js/pdfjs/pdf.mjs'; var url = \"/files/paper4.pdf\"; var pdfDoc = null; var pageNum = 1; var pageRendering = false; var pageNumPending = null; var scale = 1.5; var canvas = document.getElementById('pdf-viewer'); var ctx = canvas.getContext('2d'); function renderPage(num) { pageRendering = true; pdfDoc.getPage(num).then(function(page) { var viewport = page.getViewport({ scale: scale }); canvas.width = viewport.width; canvas.height = viewport.height; var renderContext = { canvasContext: ctx, viewport: viewport }; var renderTask = page.render(renderContext); renderTask.promise.then(function() { pageRendering = false; if (pageNumPending !== null) { renderPage(pageNumPending); pageNumPending = null; } }); }); document.getElementById('page-num').textContent = num; } function queueRenderPage(num) { if (pageRendering) { pageNumPending = num; } else { renderPage(num); } } window.prevPage = function() { if (pageNum = pdfDoc.numPages) return; pageNum++; queueRenderPage(pageNum); }; GlobalWorkerOptions.workerSrc = \"/js/pdfjs/pdf.worker.mjs\"; getDocument(url).promise.then(function(pdfDoc_) { pdfDoc = pdfDoc_; document.getElementById('page-count').textContent = pdfDoc.numPages; renderPage(pageNum); });"},{"title":"Sex-based thermal comfort zones and energy savings in spaces with joint operation of air conditioner and fan","date":"2021-07-24T07:49:29.000Z","updated":"2025-03-14T15:00:21.860Z","comments":true,"path":"Paper/Paper8/index.html","permalink":"https://lyu2patrick.github.io/Paper/Paper8/index.html","excerpt":"","text":"AuthorsJunmeng Lyu, Yongxiang Shi, Heng Du, Zhiwei Lian School of Design, Shanghai Jiao Tong University, Shanghai, 200240, China https://doi.org/10.1016/j.buildenv.2023.111002 Highlights Established thermal comfort zones for the co-running spaces of air conditioning and fans. Incorporating FACS can reduce HVAC system energy consumption by more than 16 %. Considering sex differences in FACS operation leads to additional energy savings. AbstractFan and air conditioner combined systems (FACS) have been demonstrated as a viable alternative to conventional air conditioning systems, providing thermal comfort to occupants while consuming less energy. However, few studies have quantitatively established occupant comfort zones for FACS operation and analyzed its energy saving effects. An experiment was conducted first to develop thermal comfort zone in spaces with FACS operation. As the indoor temperature rises, the upper limit of air speed accepted by occupants increases. Females exhibit an upper comfort range parameter of 29.8 °C and 1.4 m&#x2F;s, while males demonstrate 29.3 °C and 1.5 m&#x2F;s. There are noticeable differences in comfort ranges between males and females, especially in cooler conditions. Based on the established comfort zone, energy simulation studies were conducted for most regions of China to investigate the potential energy savings resulting from the implementation of FACS in ASHRAE standard office building. Buildings incorporating FACS demonstrate a reduction in HVAC system energy consumption by more than 16 % when compared to indoor temperature set at 26 °C. In hot summer and warm winter climates, HVAC system energy savings of over 100 GJ&#x2F;year can be achieved using FACS for the standard building. Considering sex differences in FACS operation leads to additional energy savings. Graphical abstract Figures Fig. 2. Relationship between existing studie and this study ​ Fig. 5. Thermal sensation in different experiment conditions ​ Fig. 6. Sex-specific thermal sensation in different environments. ​ ​ Fig. 10. Annual system electricity consumptions in cooling season of standard building with different operation settings ​ Fig. 11. a) Comparison of actual thermal comfort votes with thermal comfort zone. b) Comparison of thermal comfort votes given in existing studies with thermal comfort zone proposed in this study ConclusionsIn order to analyze the comprehensive impact of FACS on occupant comfort and energy efficiency, this study utilized a regression algorithm to establish a range of comfort parameters for air conditioning and fan operation. The comfort zone established demonstrates that the upper limit of air speed for user comfort increases with rising ambient temperature. For females, the upper limit of comfort parameters is an air temperature of 29.8 °C and an air speed of 1.4 m&#x2F;s, while for males, it is 29.3 °C and 1.5 m&#x2F;s. In cooler environments, there are noticeable differences in the sensation of draft and thermal comfort between sexes. Specifically, in an environment set at 24 °C, the difference in the upper limit of air speed required to maintain comfort between sexes can reach 0.5 m&#x2F;s. In spaces where uniform air speed and indoor air temperature are required, the upper limit for environmental parameters to ensure the comfort of all occupants (both sexes) is 29.0 °C and an airspeed of 1.3 m&#x2F;s. Furthermore, EnergyPlus software was used to simulate the energy consumption of an office building compliant with the ASHRAE standards, considering the application of FACS. The results demonstrate that this system achieves significant energy savings. In regions with hot summers and warm winters, the combined operation of fans and air conditioning can result in energy savings exceeding 100 GJ&#x2F;year. Overall, compared to creating a uniform indoor environment at 26 °C, buildings utilizing a combined fan and air conditioning system can reduce HVAC system energy consumption by over 16 %. Additionally, considering sex differences when implementing this system can further contribute to energy savings of approximately 4 %. Paper PDF Viewer Previous Page: / Next import { getDocument, GlobalWorkerOptions } from '/js/pdfjs/pdf.mjs'; var url = \"/files/paper8.pdf\"; var pdfDoc = null; var pageNum = 1; var pageRendering = false; var pageNumPending = null; var scale = 1.5; var canvas = document.getElementById('pdf-viewer'); var ctx = canvas.getContext('2d'); function renderPage(num) { pageRendering = true; pdfDoc.getPage(num).then(function(page) { var viewport = page.getViewport({ scale: scale }); canvas.width = viewport.width; canvas.height = viewport.height; var renderContext = { canvasContext: ctx, viewport: viewport }; var renderTask = page.render(renderContext); renderTask.promise.then(function() { pageRendering = false; if (pageNumPending !== null) { renderPage(pageNumPending); pageNumPending = null; } }); }); document.getElementById('page-num').textContent = num; } function queueRenderPage(num) { if (pageRendering) { pageNumPending = num; } else { renderPage(num); } } window.prevPage = function() { if (pageNum = pdfDoc.numPages) return; pageNum++; queueRenderPage(pageNum); }; GlobalWorkerOptions.workerSrc = \"/js/pdfjs/pdf.worker.mjs\"; getDocument(url).promise.then(function(pdfDoc_) { pdfDoc = pdfDoc_; document.getElementById('page-count').textContent = pdfDoc.numPages; renderPage(pageNum); });"},{"title":"Research on Thermal Sensation Assessment of Vehicle Cabin Occupants Based on Thermal Imaging","date":"2021-07-24T07:49:29.000Z","updated":"2023-11-30T13:57:47.051Z","comments":true,"path":"categories/Program4/index.html","permalink":"https://lyu2patrick.github.io/categories/Program4/index.html","excerpt":"","text":"Funded by: NIO Automotive Co., Ltd Research cycle: November 2022 – December 2023 Responsible for: Completed a thermal imaging-based model for assessing the thermal sensation of cabin occupants."},{"title":"Mechanisms of indoor and outdoor environmental impacts on the physical and mental health of the population and monitoring technology research","date":"2021-07-24T07:49:29.000Z","updated":"2023-11-30T13:58:17.482Z","comments":true,"path":"categories/Program1/index.html","permalink":"https://lyu2patrick.github.io/categories/Program1/index.html","excerpt":"","text":"Funded by: National Key Research and Development Program of China Research cycle: November 2022 – November 2025 Responsible for: mechanisms and patterns of influence of typical environmental factors on the physical and mental health of the population research (Key researcher)."},{"title":"Addressing personalized thermal comfort in residential settings A novel dual supply vent air conditioner","date":"2021-07-24T07:49:29.000Z","updated":"2025-03-14T15:03:55.761Z","comments":true,"path":"Paper/Paper9/index.html","permalink":"https://lyu2patrick.github.io/Paper/Paper9/index.html","excerpt":"","text":"AuthorsYuxin Yang, Zisheng Zhao, Junmeng Lyu, Bo Wang, Jinbo Li, Shuguang Zhang, Zhiwei Lian a School of Design, Shanghai Jiao Tong University, Shanghai, 200240, China b Guangdong Midea Air-Conditioning Equipment Co., Ltd, Guangdong, 528311, China https://doi.org/10.1016/j.jobe.2023.108134 Highlights A new effective approach for personalized comfort in residential settings. Dual-supply vent air conditioner creates diverse thermal zones. Comprehensive impact of temperature and air velocity on human thermal perception. AbstractA new approach was proposed for meeting diverse thermal comfort demands of different occupants by using a dual-supply vent air conditioner with independent control of the air supply parameters at each vent to establish distinct thermal environments. The feasibility of this method was tested in a living room environment, and numerical simulation was conducted to explore the differences in thermal environment at various locations under different air supply temperatures, velocities, directions, and vent positions. The results indicated that, within the targeted air supply zone, the maximum temperature difference could reach around 2.5 °C. Considering the Cooling Effect of air velocity, the maximum Equivalent Temperature difference was around 4.5 °C, which could address the differences in common personalized thermal comfort preference. Utilizing the differential air supply velocities of different vents was an effective means of achieving diverse thermal environments, although attention should be paid to local thermal discomfort caused by drafts. This approach may offer a new perspective in addressing the differing thermal comfort preferences among occupants within the same residential room, additionally providing innovative insights for improving traditional air conditioning systems. Figures Fig. 1. Schematic representation of the scenario ​ Fig. 3. Comparisons between simulated and measured results ​ Fig. 4. Calculated surface ​ Fig. 7. Air temperature and velocity distributions under different air supply directions ​ Fig. 15. Temperature distribution and air velocity vector map at z = 0.6 m height ConclusionsThe potential of creating differentiated thermal environments using two air supply vents on a single air conditioner was investigated. The effects of air supply direction, air supply temperature, air supply velocity, and vent location on the distribution of air temperature and air velocity were analyzed. The differentiation level of the thermal environment was evaluated by assessing the air temperature and the Equivalent Temperature that incorporates the Cooling Effect at different locations within the Target Zone of air conditioning. The main conclusions are as follows: In the Target Zone of air conditioner, three distinct zones could be created: a high-temperature&#x2F;high-velocity zone, a low-temperature&#x2F;high-velocity zone, and a medium-temperature&#x2F;low-velocity zone. Among them, the high-temperature&#x2F;high-velocity zone provided comfortable and energy-efficient operation, while the medium-temperature&#x2F;low-velocity zone was the warmest and the low-temperature&#x2F;high-velocity zone was the coolest. Furthermore, the draught rate in the medium-temperature&#x2F;low-velocity zone was minimized. Taking into account the Cooling Effect, the maximum Equivalent Temperature difference among the three zones could reach around 3.0 °C. The research results demonstrated the feasibility of using dual air supply vents on the air conditioner to create diversified thermal environments. By controlling the air supply temperature difference, the Equivalent Temperature difference among different calculated surfaces within the Target Zone could reach around 4.5 °C, which was possible to meet the common individual thermal demand differences. A supply air temperature difference of 6 °C was already effective in creating a differentiated thermal environment. Fully utilizing the disparities in air velocity was found to be an effective approach in achieving distinct thermal environments. In the experimental conditions, when two vents supplied air at velocities of 4 m&#x2F;s and 6 m&#x2F;s respectively, the maximum Equivalent Temperature difference could be observed within the Target Zone. Compared to horizontally oriented supply airflow, directing airflow towards the Target Zone resulted in greater temperature differences and Equivalent Temperature differences at various positions within the zone. When the two supply vents were positioned too closely, it was necessary to adjust the airflow direction to separate the airflows, ensuring temperature differences and Equivalent Temperature differences at different positions. Paper PDF Viewer Previous Page: / Next import { getDocument, GlobalWorkerOptions } from '/js/pdfjs/pdf.mjs'; var url = \"/files/paper8.pdf\"; var pdfDoc = null; var pageNum = 1; var pageRendering = false; var pageNumPending = null; var scale = 1.5; var canvas = document.getElementById('pdf-viewer'); var ctx = canvas.getContext('2d'); function renderPage(num) { pageRendering = true; pdfDoc.getPage(num).then(function(page) { var viewport = page.getViewport({ scale: scale }); canvas.width = viewport.width; canvas.height = viewport.height; var renderContext = { canvasContext: ctx, viewport: viewport }; var renderTask = page.render(renderContext); renderTask.promise.then(function() { pageRendering = false; if (pageNumPending !== null) { renderPage(pageNumPending); pageNumPending = null; } }); }); document.getElementById('page-num').textContent = num; } function queueRenderPage(num) { if (pageRendering) { pageNumPending = num; } else { renderPage(num); } } window.prevPage = function() { if (pageNum = pdfDoc.numPages) return; pageNum++; queueRenderPage(pageNum); }; GlobalWorkerOptions.workerSrc = \"/js/pdfjs/pdf.worker.mjs\"; getDocument(url).promise.then(function(pdfDoc_) { pdfDoc = pdfDoc_; document.getElementById('page-count').textContent = pdfDoc.numPages; renderPage(pageNum); });"},{"title":"Air quality assurance system for cabins of large cruise ships research","date":"2021-07-24T07:49:29.000Z","updated":"2023-11-30T13:58:48.643Z","comments":true,"path":"categories/Program2/index.html","permalink":"https://lyu2patrick.github.io/categories/Program2/index.html","excerpt":"","text":"Funded by: Key Research and Development Program of the Ministry of Industry of China Research cycle: September 2020 – October 2023 (Completed) Responsible for: Kitchen environmental control solutions study (Independent researcher)"},{"title":"Research on Thermal Environmental Control Strategies Targeting Gender Differences","date":"2021-07-24T07:49:29.000Z","updated":"2023-11-30T13:53:03.913Z","comments":true,"path":"categories/Program3/index.html","permalink":"https://lyu2patrick.github.io/categories/Program3/index.html","excerpt":"","text":"Funded by: Midea Air-Conditioning Equipment Co., Ltd Research cycle: November 2021 – August 2023 (Completed) Responsible for: · Completed a thermal imaging-based model for assessing the thermal sensation of indoor occupants. · Establishment of comfort zones for gender-specific indoor environments. · Develop a data-driven thermal sensation model based on historical air-conditioning behavioral data"}],"posts":[{"title":"Test","slug":"my-first-blog","date":"2023-11-30T07:49:29.000Z","updated":"2023-11-30T12:52:36.249Z","comments":true,"path":"2023/11/30/my-first-blog/","permalink":"https://lyu2patrick.github.io/2023/11/30/my-first-blog/","excerpt":"","text":"","categories":[],"tags":[]}],"categories":[],"tags":[]}